[{"i":"4201515f-16ec-4051-2384-201515f94811","d":"2005-02-02 22:17:03","u":"http:\/\/www.trachtenberg.com\/","n":"Adam Trachtenberg","c":"<b>gopher?<\/b><br\/>\n<p>You get gopher trackbacks? You rule!  <\/p>","email":"http:\/\/www.trachtenberg.com\/","url":"http:\/\/www.trachtenberg.com\/"},{"i":"42026198-7b41-3500-3071-2026198cc41f","d":"2005-02-03 17:38:32","u":"anon","n":"Toby Hackstock kc8imd(a)comcast(.)net","c":"<b>MMU question<\/b><br\/>\n<p>Completely off-topic (apologies in advance)   <\/p>\n<p>On the UAE homepage I noticed that you (I think) wrote a patch to give that emulator MMU support. I wish to run NetBSD on UAE to use the Sun3 compatibility layer (long story) to execute an ancient ADA cross-compiler.   <\/p>\n<p>Do you still have the binaries from when you were working on this project? I briefly tried to compile it last night, and ran into problems. I will try to resolve those tonight, but I decided to try the easy approach as well by contacting you in the meantime.   <\/p>\n<p>Also, might you have any other ideas for running NetBSD on virtual 68k hardware?   <\/p>\n<p>Thank you, Toby  <\/p>","email":"Toby Hackstock kc8imd(a)comcast(.)net","url":null},{"i":"42026379-f22e-4757-1432-202637953fca","d":"2005-02-03 17:46:33","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>That was me<\/b><br\/>\n<p>The MMU Emulation wasn't complete enough to get to init on linux though, and was really really slow.  IIRC, there was an Atari m68k emulator that might have had MMU support.  You might be better off just trying to find someone actually running NetBSD\/m68k hardware and asking them for a shell.   <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"4205b123-e41b-8420-8452-205b12330c55","d":"2005-02-06 05:54:43","u":"anon","n":"c. s.","c":"<b>RBL is not fool proof<\/b><br\/>\n<p>As you should already be aware, using an RBL (or any number of RBL combinations) is hardly an effective solution.  I had 17 attempts, each from a unique ip address within a 3 minute time frame.  Only half of them showed up in a multi-RBL check.  <\/p>","email":"c. s.","url":null}]