[{"i":"48ff3b5d-aa20-4a44-97a8-6bda0808261f","d":"2008-10-22 10:40:29","u":"http:\/\/eliw.com\/","n":"EliW","c":"<b>Price is the Key<\/b><br\/>\n<p>Thanks for the review Wez.  I&#039;ve been tempted, time to time, to get a Kindle.<\/p>\n<p>Price is the big holdback, because in the end, I don&#039;t see myself being able to buy something like this, without having two of them, so my wife &amp; I wouldn&#039;t have to share.  (IE, her going on a trip and taking it, and therefore leaving me without my book I was reading)<\/p>\n<p>I also have a &#039;dream&#039;.  This dream, would involve a kindle-like device, that would have both audio &amp; text versions of the same book.  And allow you to easily switch back and forth between them.<\/p>\n<p>So I could hop in the car for a drive, and have it read me the next 2 chapters.  Then curl up in bed in the evening and be reading the text from where it left off.  Lemme know when that is available :)<\/p>\n<p><\/p>","email":"http:\/\/eliw.com\/","url":"http:\/\/eliw.com\/","did":"51533916"},{"i":"c9000584-4344-4e0c-b254-6bba0808261f","d":"2008-10-23 01:03:00","u":"http:\/\/netevil.org","n":"wezfurlong","c":"<b>it does audio too<\/b><br\/>\n<p>The kindle does have audiobook support (and experimental mp3 player), but I&#039;ve not tried it... yes, it would be very cool to have it seamlessly read you the book while in the car.<\/p>\n<p>I&#039;m not an audiobook person;  I quite enjoy reading in a quiet room and find listening to spoken words harder than reading.  I think it&#039;s because I can read much faster than people tend to speak, so listening takes more time per sentence and I find that I have to really divert attention to listen effectively when anything worth listening to is going on.<\/p>\n<p>Yes, I think the price is still a bit high, and I&#039;ve heard that some significant advances in the screen technology have been made this past year; I think it won&#039;t be long before the price goes down and we get even better devices.<\/p>\n<p><\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org","did":"51533917"},{"i":"c93ed284-ad3c-4d01-b69d-05ad0808261f","d":"2008-12-09 15:18:12","u":"anon","n":"PhilPalmieri.com","c":"<b>Got mine last monday<\/b><br\/>\n<p>Hey Wez,<\/p>\n<p>I got mine last monday and have been plowing through books since.  I agree the buttons are just a bit annoying, but you train yourself not to push it.  Also, i&#039;m with you about the page turning, i find that i push it in the bottom right and by the time my eye goes to the top left its changed already.<\/p>\n<p>Phil<\/p>","email":"PhilPalmieri.com","url":null,"did":"51533918"}]