[{"i":"43818e82-c249-0445-1551-3818e823ef57","d":"2005-11-21 09:08:18","u":"anon","n":"Jakub Vrana","c":"<b>USB token<\/b><br\/>\n<p>It's not usable everywhere but you can also store your preferences on USB token and bring it everywhere with you.  <\/p>","email":"Jakub Vrana","url":null},{"i":"438578d6-c535-5658-3762-38578d680575","d":"2005-11-24 08:24:54","u":"anon","n":"Markus","c":"<b>Commercials?<\/b><br\/>\n<p>From the CommuniGatePro readme:   <\/p>\n<p>The CommuniGate Pro is a high-speed, heavily multi-threaded server application implementing extended SMTP, POP3, IMAP4rev1, MAPI, poppwd, LDAP, ACAP, and other messaging services.   <\/p>\n<p>So it seems commercial implementations on server side to exist. Just the clients ones not. But, using IMAP seems awkwards. HTTP PUT\/WebDAV seems more suited nowadays.  <\/p>","email":"Markus","url":null},{"i":"43863e71-cdcb-3639-2590-3863e715f573","d":"2005-11-24 22:28:01","u":"anon","n":"dave@cridland.net","c":"<b>ACAP server<\/b><br\/>\n<p>This (http:\/\/dave.cridland.net\/acap\/) has an ACAP server for Linux under GPL license, an ACAP-aware IMAP client (also GPL, but this time cross platform), called Polymer, which roams using ACAP quite nicely, though I say so myself.   <\/p>\n<p>HTTP doesn't cut it as a configuration service on its own - there's a proposal called XCAP which does that, but it really doesn't work properly unless you put in an entire SIP stack as well.  <\/p>","email":"dave@cridland.net","url":null},{"i":"43a72e09-d6a8-4938-9642-3a72e090fee2","d":"2005-12-19 22:02:49","u":"anon","n":"ml@blas.net","c":"<b>I have been waiting for so long ...<\/b><br\/>\n<p>Indeed, since 2000 or so I'm waiting for such a implementation. I'm fed up being compelle to update my imp's filters when I  set up a new rule on thunderbird and vice-versa. Personaly, I think there was not, up these days, a real demand for that kind of client (the problem is the lack of ACAP-aware clients). Most traveling people use webmail accounts and professional have  legacy solution via Webmail or Blackberry. With the expand of public mobile solutions like the Nokia 770 I hope there will be a new demand for that kind of thing. Polymer is being ported toe this platform. That is a good thing.   <\/p>\n<p>db  <\/p>","email":"ml@blas.net","url":null}]