[{"i":"4b92510d-c228-4a61-a2e9-43e30808261f","d":"2010-03-06 07:56:45","u":"","n":"Wing Tip Schu","c":"<b>64-bit version of Evildesk<\/b><br\/>\n<p>I have manually installed some of the files from the 64-bit Evildesk 0.9.0 distribution for use as a GUI shell with WinPE 3.0 [Windows 7 based]. It works reasonably well but there are a few minor, mostly cosmetic but workable, incompatibilities.<\/p>\n<p>Now that Evildesk has become open source, I hope other developers will be willing to continue its development.<\/p>\n<p>Is there any way that I could encourage others to pick-up on this project?<\/p>\n<p>A response would be greatly appreciated.<\/p>\n<p>TiA<\/p>\n<p>wingtipschu@yahoo.com<\/p>","email":"Wing Tip Schu","url":null},{"i":"47a5af2c-dbe0-4253-b236-400b0808261f","d":"2008-02-03 07:10:20","u":"anon","n":"adlermedrado@gmail.com","c":"<b>EvilDesk unavailable?<\/b><br\/>\n<p>Hello Wez.<\/p>\n<p>Is EvilDesk unavailable? I tried to get it in evildesk.netevil.org but it did not work. <\/p>\n<p>I like very much this app. Thank you for the good job.<\/p>\n<p><\/p>","email":"adlermedrado@gmail.com","url":null},{"i":"49a30e03-5340-4de6-97ca-1a7d0808261f","d":"2009-02-23 15:58:43","u":"","n":"dieco.p","c":"<b>evil desk update?<\/b><br\/>\n<p>kudos for your simple and direct aproach to the shell issue!<\/p>\n<p>i have used in the past from linux-like shells (litestep,bb4win)to comercial grade(aston, talisman) and, altough i grew very fond of aston, it doesnt work on 64 bits, or at least not as easily  as yours,  so thank you with all my heart, <\/p>\n<p>even so, im somewhat saddened by the fact that the last update of it is like 2 years old now, and wondering if your other projects will shut down this shell replacement for good, cairo shell does sound good, but its still in the future, also, youre not mentioned on shellcity.com, being your shell an ass kickin solution compared with most of that list(not so sure now, being a while since i browsed that site)<\/p>\n<p>d.pinzon<\/p>\n<p>p.s.:tried to login with my facebook account using opera 10 and the page never finished loading...=(<\/p>","email":"dieco.p","url":null},{"i":"49a3485d-e280-410e-a5a4-08060808261f","d":"2009-02-23 20:07:41","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>No immediate plans<\/b><br\/>\n<p>Thanks for your praise :-)<\/p>\n<p>I&#039;ve been using OSX for the last couple of years, so I haven&#039;t felt the need to produce any updates.<\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"4b02d000-73f4-4159-8ce8-13be0808261f","d":"2009-11-17 11:32:00","u":"anon","n":"Kaspric","c":"<b>Perfect ap<\/b><br\/>\n<p>Thx Wez for your shell! It&#039;s has everything I&#039;ve been looking for. Simple, soo fast, and really looking so great (&#039;cause of simplicity). I&#039;ve been working at your shell for 2 months and haven&#039;t noticed any important problem (and if I noticed it&#039;s able to be fixed).<\/p>\n<p>Only two mistakes:<\/p>\n<p>- application trays don&#039;t hide if I end them. It&#039;s able to fix it by restarting shell (it&#039;s not problem), but then some trays of working programs aren&#039;t showed again.<\/p>\n<p>- there is problem with applications with transparent look, for example foobar. It&#039;s hanging up when I change desks. But You can fix it by denying transparency. Everything works good now :)<\/p>\n<p>Thx Wez once again!<\/p>","email":"Kaspric","url":null}]