[{"i":"446319d8-c9e8-6383-4925-46319d8ef718","d":"2006-05-11 11:02:48","u":"anon","n":"Aaron","c":"<b>The vast majority<\/b><br\/>\n<p>A nice option for windows programs to have would be to specify a folder where programs could download the updates into. Then if for whatever reason if you don't want your software to autoupdate, it could just download the software and somehow let you know.   <\/p>\n<p>The fact is that most clueless windows users (including myself) run in an administrative account. For the most part I appreciate the fact that my antivirus program (the only program that I use which updates itself) does so every couple days without bothering me.  <\/p>","email":"Aaron","url":null},{"i":"44635d06-f3e4-4542-8359-4635d06c3482","d":"2006-05-11 15:49:26","u":"anon","n":"ian c rogers","c":"<p>Howdy.  Ian from Yahoo! here.  Sorry about that.   <\/p>\n<p>I'll kick this over to the team so they can take a look and try to figure out what happened here.   <\/p>\n<p>ian  <\/p>","email":"ian c rogers","url":null},{"i":"44635df8-7a45-1553-5350-4635df81b9d5","d":"2006-05-11 15:53:28","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>Thanks!<\/b><br\/>\n<p>Thanks Ian.   <\/p>\n<p>Just out of interest, did you land here because of the bug report I filed, or through some other means?  <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"4464df44-278a-4500-1999-464df44759f6","d":"2006-05-12 19:17:24","u":"anon","n":"ian c rogers","c":"<b>Small J<\/b><br\/>\n<p>I didn't see the bug report, those don't come to me.  My friend Jon Bauer sent me here.   <\/p>\n<p>ian  <\/p>","email":"ian c rogers","url":null},{"i":"446803da-7abe-1452-3381-46803da6a901","d":"2006-05-15 04:30:18","u":"anon","n":"gaby de wilde","c":"<b>admini<\/b><br\/>\n<p>I think Microsoft swapped the names? So called &quot;average users&quot; are (mostly) Administrators and so called &quot;admins&quot; are (mostly) average users.   <\/p>\n<p>Peeps who have nothing to administrate don't need the extra protection.(joke) I do think you would have less reason to complain if it was called &quot;secure log on&quot; or something like that. Maybe even the yahoo's would use it then?  <\/p>","email":"gaby de wilde","url":null}]