[{"i":"437b21d7-b07e-8902-3017-37b21d7bfe59","d":"2005-11-16 12:11:03","u":"anon","n":"thekabal@gmail.com","c":"<b>For shame.<\/b><br\/>\n<p>Shame on you.   <\/p>\n<p>You already understand the issue John is having. You state it not once, but twice in your post criticizing him.   <\/p>\n<p>He uses bind by ?, instead of parameter names. PDO doesn't support them yet (because of your experimental status).   <\/p>\n<p>Both of his posts describe that exact behavior, and specifically state that its &quot;probably due to their experimental status&quot;.   <\/p>\n<p>Criticizing someone for providing a clear and well-written bug report is bad enough. But then telling him to <b>change his behavior<\/b> when you plan to implement that exact behavior later is a great way to ensure you won't get bug reports.   <\/p>\n<p>I've seen plenty of complaining about the php team's quick-to-bogus status for bugs, but when you stretch that arrogance out to someones blog post?   <\/p>\n<p>You've really taken the cake. For shame.   <\/p>\n<p>Stop being so defensive, and just implement the getColumnMeta already.  <\/p>","email":"thekabal@gmail.com","url":null},{"i":"437b3228-2b95-9436-0731-37b322845d23","d":"2005-11-16 13:20:39","u":"http:\/\/derickrethans.nl\/","n":"Derick Rethans","c":"<b>Bug?<\/b><br\/>\n<p>It's not a <b>bug<\/b> report if it's not in the bugs database (http:\/\/bugs.php.net). And PDO is not the first thing (http:\/\/phplens.com\/phpeverywhere\/?q=node\/view\/214) that John whines about before  understanding the underlying issues.  <\/p>","email":"http:\/\/derickrethans.nl\/","url":"http:\/\/derickrethans.nl\/"},{"i":"437b332a-9cd6-7540-4659-37b332a7c56c","d":"2005-11-16 13:24:58","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>a good dose of the fine manual is in order<\/b><br\/>\n<p>I suggest that anyone else that thinks that either named or positional parameters don't work in PDO take a few minutes and go and read the various publications, conference slides and even (gasp!) the PHP manual, and hey, maybe even try it, before they suggest otherwise.   <\/p>\n<p>I've yet to see a clear written bug report from John, so I'm merely stating that in my blog.  Without a clear bug report we have to <b>guess<\/b> what John is doing, or otherwise develop psyhic abilities.   <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"437b34df-9158-9122-0029-37b34dfcbce9","d":"2005-11-16 13:32:15","u":"anon","n":"lists@cyberlot.net","c":"<b>Wez is doing a great job<\/b><br\/>\n<p>I have been playing around and using PDO on and off since it first came out. It provides more functionality and protection then the original mysql library ever did in most cases.   <\/p>\n<p>As to bugs, Ever email I have sent to phpdev mailing list ( asking good questions instead of spending my time whining on some blog ) has been answered in a prompt and polite manner.   <\/p>\n<p>The php developers have set methods and ways to report issues and whining on a blog is not one of them.  <\/p>","email":"lists@cyberlot.net","url":null},{"i":"437b7a2f-0f29-7179-3463-37b7a2fd41d9","d":"2005-11-16 18:27:59","u":"anon","n":"marcot@tabini.ca","c":"<b>First things first<\/b><br\/>\n<p>Let's not shoot the messenger here... Wez is making a very valid point without being judgemental, so I see no need to attack him. The mere fact that he has to guess at the problem because no proper bug report was filed is an indication of time being wasted because of poor communication.  <\/p>","email":"marcot@tabini.ca","url":null},{"i":"437bbc9b-f455-9163-1199-37bbc9b43f89","d":"2005-11-16 23:11:23","u":"http:\/\/www.powertrip.co.za\/blog\/","n":"Jacques","c":"<b>Oi!  Play nicely in the sandpit<\/b><br\/>\n<p>Okay I get that there are many ways of doing things, even in the code base which I maintain I use authoritative arrays and having some code to do some magic to generate the SQL minus requiring a bindparam ala Oracle Style.   <\/p>\n<p>Generally it's easier to blog about an issue than it is to post a bug report. ;)  <\/p>","email":"http:\/\/www.powertrip.co.za\/blog\/","url":"http:\/\/www.powertrip.co.za\/blog\/"},{"i":"437bee47-cc1d-3415-1725-37bee47afb69","d":"2005-11-17 02:43:19","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>easier but lazier<\/b><br\/>\n<p>When I'm blessed with some &quot;PHP time&quot;, I don't go trawling through the internet to find problems that people are complaining about on their blogs.  I also don't sit and meditate, hoping to pick up problems from the psychic aether.  No, I sit down and check the PHP and PECL bug databases.  Sometimes I'll even search my heavily laden inbox (I get a <b>lot<\/b> of mail) if I manage to remember that someone emailed me about a problem.   <\/p>\n<p>I lead a busy life; my memory is mostly dedicated to things that are really really important to me, and that doesn't tend to include stuff in my mailbox or blogs.  Anything else that I want to get done goes into some kind of tracker or calendar.   <\/p>\n<p>Filing bug reports is important a number of reasons:   <\/p>\n<p><ul>\n<li>so it won't be forgotten\n <li>so that others can find the issue\n <li>so that we can associate a patch with the problem as part of our QA process.\n   <\/ul>\n<p>The first two are particularly important for me.  It can easily be a couple of weeks before I get time to sit down and deal with a bug report.  If it's come in via email and I've been really busy, it will likely be forgotten, so I suggest that the reporter file it properly.  Having it in the bug tracker not only allows other people to find the problem,  but also allows the other developers to be made aware of it, and possibly even fix it.   <\/p>\n<p>The last point is part of our quality assurance; our general rule is to only allow bug fixes on the stable branches.  Ideally, each commit will have a bug number associated with it, and will be noted in the NEWS file.  You can then look it up in the bug db to find out additional information about it.   <\/p>\n<p>So, while I understand being lazy (it's soo convenient), I also <b>know<\/b> that without the help of people that are running into problems, those problems won't get resolved, and that is really what my blog post was all about.   <\/p>\n<p>There's no substitute for being thorough; a half-assed bug report is usually a good indicator that the reporter hasn't taken the time to read the manual, and thus that the problem is really their fault.  Logically, you can extend this back to blogging about problems; if the reporter hasn't even made it as far as the bug tracker, then the outlook is not so good.   <\/p>\n<p>So, lazy is fine, and blogging about your problems is also fine, provided that you don't expect anything to be done about it.  In OpenSource if you want something fixed, you need contribute to the process.  <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"4381a2e4-ae27-8993-0883-381a2e4ced8a","d":"2005-11-21 10:35:16","u":"anon","n":"ante.drnasin@dfgcon.si","c":"<b>So true<\/b><br\/>\n<p><i>In OpenSource if you want something fixed, you need contribute to the process<\/i>   <\/p>\n<p>So true....  <\/p>","email":"ante.drnasin@dfgcon.si","url":null},{"i":"4394cfe1-e46f-0169-4222-394cfe110ddb","d":"2005-12-05 23:40:17","u":"anon","n":"Gerry","c":"<b>Yeah but...<\/b><br\/>\n<p>there may be an element of truth to it.   <\/p>\n<p>For instance I really wish it were possible on the PHP Manual add comments, to also submit bugs or ask questions instead of just being able to add comments.   <\/p>\n<p>If all three things were tied into the manual pages then it would also help for the people reading the manual as they could not only see comments, but also questions and answers, and bug or feature requests all relating to that particular manual page.   <\/p>\n<p>As it currently stands, people need to to search in three different locations to find or add comments, bugs and Q&amp;A that all related to the one manual page and as a result they'd rather just open up their blog and complain about it all in the one place.   <\/p>\n<p>I would have submitted this as a feature request, but I didn't see that ability on the add-notes page, which is what the features relates to. =D   <\/p>\n<p><b>The ability to add related notes to manual pages is a great feature, I just don't see why it was limited to notes.<\/b>   <\/p>\n<p>BTW. Thanks Wez, for all the work you have put into making PHP better and cute dog you have there. She looks very similar to my Kelpie X.  <\/p>","email":"Gerry","url":null},{"i":"43a888f5-92c1-4770-7214-3a888f56c728","d":"2005-12-20 22:43:01","u":"anon","n":"Nathan de Vries","c":"<b>Blogging vs Bug Reporting...<\/b><br\/>\n<p>I agree with you Wez. The very act of submitting a bug report acknowledges the fact that you are part of a community which requires the bug to be fixed. By blogging about it, you make that bug yours.   <\/p>\n<p>It's a case of &quot;I want it fixed&quot; versus &quot;This should be fixed.&quot; Personally, I think the former is quite rude.  <\/p>","email":"Nathan de Vries","url":null}]