[{"i":"42d7ab45-4dd8-2370-9758-2d7ab4547e4f","d":"2005-07-15 12:25:41","u":"anon","n":"andreas","c":"<b>\/me<\/b><br\/>\n<p>We're going to build a desktop web app in the next weeks that has to run on Win98 and above. I think most of the people run W2K and above, but support for Win98 and ME is required.  <\/p>","email":"andreas","url":null},{"i":"42d7b0a4-1a9d-1062-3047-2d7b0a501160","d":"2005-07-15 12:48:36","u":"anon","n":"schotte@mayflower.de","c":"<b>ThinkPHP delivers<\/b><br\/>\n<p>Hi,   <\/p>\n<p>we were rolling out more than 100,000 installations of the spare parts shop for the Vaillant Group (for the first three countries, 12 will follow soon) on CD, requiring Win95\/Win98 or above (at least with a TCP\/IP stack :-).   <\/p>\n<p>Most problems were due to crippled TCP\/IP stacks from proprietary providers. We deliver with Microweb, PHP4 and SQLite where we have the full control of the PHP version - but we don't have the control of all the OS environments of the users out there.  <\/p>","email":"schotte@mayflower.de","url":null},{"i":"42d7b314-f0cf-3682-1239-2d7b314d30e2","d":"2005-07-15 12:59:00","u":"http:\/\/derickrethans.nl\/","n":"Derick Rethans","c":"<b>Win 95<\/b><br\/>\n<p>Windows 95 is already not supported in PHP...  <\/p>","email":"http:\/\/derickrethans.nl\/","url":"http:\/\/derickrethans.nl\/"},{"i":"42d7b33a-905c-2274-3870-2d7b33a7d9aa","d":"2005-07-15 12:59:38","u":"http:\/\/derickrethans.nl\/","n":"Derick Rethans","c":"<b>Win 95<\/b><br\/>\n<p>Windows 95 is already not supported in PHP...  <\/p>","email":"http:\/\/derickrethans.nl\/","url":"http:\/\/derickrethans.nl\/"},{"i":"42d7bf7c-f652-8977-7532-2d7bf7c4301a","d":"2005-07-15 13:51:56","u":"anon","n":"Sean Coates","c":"<b>Old ver\/backports<\/b><br\/>\n<p>While I don't personally run PHP on Windows (so you can feel free to discard my opinions), I think it's reasonable to expect users who run a very old version of their operating system to run proportionally old versions of their applications.   <\/p>\n<p>That is to say: If you're running Windows &lt; 2000, then PHP 5.1 is the last version of PHP you can use.   <\/p>\n<p>I'd hate to see thousands of ifdefs to use these new API calls. Perhaps, if someone really needs this, they can maintain a fork. I doubt that will be necessary, though.   <\/p>\n<p>S   <\/p>","email":"Sean Coates","url":null},{"i":"42d7c3ed-c8cb-4844-2256-2d7c3ed9fc6b","d":"2005-07-15 14:10:53","u":"anon","n":"KJ","c":"<b>Here here<\/b><br\/>\n<p>Damn right, Sean.  <\/p>","email":"KJ","url":null},{"i":"42d7dca4-57c5-4310-9090-2d7dca44a55a","d":"2005-07-15 15:56:20","u":"anon","n":"Sara Golemon","c":"<b>Let them eat stale cake<\/b><br\/>\n<p>Win2K is EOL and PHP &lt;= 5.0 are feature frozen (5.1 -- quite possibly the last 5.x branch -- will be frozen soon enough and I assume you're not planning on folding non 9x features into that branch).   <\/p>\n<p>IMO, If the OS is that old, then let the PHP version be &quot;old&quot; as well (though &quot;old&quot; is a relative term when you consider that 5.1 would continue to work clear back to 98)   <\/p>","email":"Sara Golemon","url":null},{"i":"42d7e778-46b1-9832-2625-2d7e778a75ce","d":"2005-07-15 16:42:32","u":"anon","n":"deekayen","c":"<b>+1 Sean Coates<\/b><br\/>\n<p>It's not as if dropping future support breaks all the old releases. If PHP core developers decide they still want to listen to some Win 9x users, then maintain security patches for the last version of PHP that supports Win 9x.  <\/p>","email":"deekayen","url":null},{"i":"42d7fee3-d660-8487-7538-2d7fee331eb0","d":"2005-07-15 18:22:27","u":"anon","n":"sorccu","c":"<b>98se <3<\/b><br\/>\n<p>I'm using Windows 98se, but only for developing on localhost. Although I am planning to buy a new computer &amp; OS, I don't think that it's time to drop w98 support yet. One of the greatest assets of PHP is that it works almost anywhere. W98 is still amazingly popular. It's like IE5.. all you can do is to hope for it to DIE!! Well. What are these APIs that 'PHP would benefit from using' anyway?  <\/p>","email":"sorccu","url":null},{"i":"42d80266-fcbe-1187-9674-2d80266345a5","d":"2005-07-15 18:37:26","u":"anon","n":"wrowe@apache.org","c":"<b>Gonna lose 9x support in Apache soon<\/b><br\/>\n<p>If it's any consolation - the Apache HTTP Server project will likely drop support for 9x in the next 2.2 minor bump.  And that includes dropping ME.   <\/p>\n<p>For anyone seriously using Apache\/PHP, 2.0.x\/5.0.x (or 4.4.x for that matter) will be fine.  They can't even get security fixes, can they?  Obviously such boxes are for experimenting, not serious work.  <\/p>","email":"wrowe@apache.org","url":null},{"i":"42d80979-5345-5318-1832-2d80979e9058","d":"2005-07-15 19:07:37","u":"anon","n":"christian@wenz.org","c":"<b>I don't use it ...<\/b><br\/>\n<p>... but about 5-10% of reader mail uses Win98 or Win98se (and very few use WinME). I don't depend on Win98 support, but these 5-10% do. But I agree with Sean -- for PHP versions after 5.1, it's probably time to move on.  <\/p>","email":"christian@wenz.org","url":null},{"i":"42d812ed-8532-7595-1751-2d812ed7b57e","d":"2005-07-15 19:47:57","u":"anon","n":"Eric Coleman","c":"<b>+1 Sean<\/b><br\/>\n<p>Drop it... how many people would need to run 5.1+ on windows 9x anyways?  From the stats i've seen on many blogs \/ client sites, 9x \/ ME users are few and far between.  <\/p>","email":"Eric Coleman","url":null},{"i":"42d817c0-c253-4737-2567-2d817c0b0deb","d":"2005-07-15 20:08:32","u":"anon","n":"Harry Fuecks","c":"<b>What's more evil?<\/b><br\/>\n<p>Thinking as per the subtitle of this blog...   <\/p>\n<p>1. Forcing those miserable users, for whom upgrading Windows means spending more than they earn in six months, to upgrade Windows, thereby simultaneously collapsing three third world economies and triggering a global economic recession   <\/p>\n<p>2. Providing endless backwards compatibility with old Windows versions, thereby eliminating the need for users to upgrade to Longhorn resulting in the final meltdown for Microsoft   <\/p>\n<p>3. Making PHP so hot for scripting on Windows, perhaps throwing in something like Winbinder (http:\/\/www.hypervisual.com\/winbinder\/overview.php) for good measure, that is displaces VB.NET as the natural path from VB6, meanwhile registering www.phpmsdn.com and charging developers $50\/month to receive PHP on a CD every few months and finally retiring to a secluded beach in a tax haven.   <\/p>\n<p>It's a tough choice.  <\/p>","email":"Harry Fuecks","url":null},{"i":"42d88aa5-004e-1588-1652-2d88aa5c472c","d":"2005-07-16 04:18:45","u":"anon","n":"Nico","c":"<p>We use win98 in two computers because i like to get the most machine resources to work. My experience with XP hasn&amp;#39;t been good specialy when all WAMP stack and editor\/debugger are loaded. I sacrifice some security but i get a lot of performance.   <\/p>\n<p>The other is an old pc we use it as test web server. We dont need passwords or other things to change configuration, so we can work faster even when using old hardware. It runs clean with a daily reboot.  <\/p>","email":"Nico","url":null},{"i":"42da5f12-4737-2444-2959-2da5f12d80a8","d":"2005-07-17 13:37:22","u":"http:\/\/goytalk.blogspot.com\/","n":"Steph","c":"<b>Drop it.  Please.<\/b><br\/>\n<p>I asked on PHP-GTK general (after having publicly agreed with Your Majesty on internals@ that win98 support should be dropped).  One developer in particular wrote to say that she has an almost-completely win98 user base...   <\/p>\n<p>As Sean (and others) have said here, the question is whether that user base is going to be OK to stay with PHP-GTK 1 and PHP 4.3.<b>.  Since the chief argument for staying with win98 appears to be the anti-change one, it would seem likely that the user base concerned is happy to stay put anyway.  (I'll revise that opinion if conflicting evidence comes in.) <\/b>  <\/p>\n<p>The other point I wanted to make is a very simple one.  We don't have anyone in php.net currently that is both able and willing to support PHP on win98, even without the proposed changes.  We have a lot of devs with access to win2k and higher, and win98 bugs <i>mostly<\/i> have been fixed simply because the platform has enough similarities to win2k for that to happen, almost as a side-effect.  If a win98-specific bug turned up tomorrow, we'd have no means of reproducing it, or of testing any potential fix for it.  In that sense, we dropped support for win98 last summer, and making it official is probably a Good Thing[TM].   <\/p>\n<p>HTH...   <\/p>","email":"http:\/\/goytalk.blogspot.com\/","url":"http:\/\/goytalk.blogspot.com\/"},{"i":"42db8084-350e-0008-5228-2db808496034","d":"2005-07-18 10:12:20","u":"anon","n":"LacaK","c":"<b>I use win98 as developer PC<\/b><br\/>\n<p>I am using win98 as developer machine. I think, that support for Win98 and Me is required, because a lot of users use still Win98 on old machines. I am living in middle-east europe. You may make Win2000 as a minimum requirements for future versions &gt; 5.1, but versions 4.4 and 5.1 leave also for win98. Thanks  <\/p>","email":"LacaK","url":null},{"i":"42dc6cd1-5409-8912-7708-2dc6cd1b903a","d":"2005-07-19 03:00:33","u":"anon","n":"Madeleine D. (mmdrake[at]php.net)","c":"<b>PHP-Gtk and a Win98 Base<\/b><br\/>\n<p>Our client base is almost entirely Win98.  They are small business and not inclined to changes or major expenses - like buying new hardware to run new OS's they don't really know or trust.   <\/p>\n<p>We promised them that our new app would be multi-platform.  In their world, that doesn't mean Linux and it means more than WinXP.  We went with the combo of PHP\/Gtk\/MySql because it could run on what they already had - a major plus.   <\/p>\n<p>I know all the talk about Win98 being passe, but if you really believe that it's not out there and in daily, critical-application use, come into my world.   <\/p>\n<p>  <\/p>","email":"Madeleine D. (mmdrake[at]php.net)","url":null},{"i":"42dd34a2-798d-3879-6402-2dd34a2dc7de","d":"2005-07-19 17:13:06","u":"http:\/\/goytalk.blogspot.com\/","n":"Steph","c":"<b>Conflicting evidence came in<\/b><br\/>\n<p>OK, so what Madeleine's saying here (for those of you without knowledge of PHP-GTK) is that quitting support for Win98 at this point is likely to mean she can't deliver PHP-GTK 2 apps to her users.   <\/p>\n<p>GTK 2 was written from the ground up keeping win32 in mind (unlike GTK 1) and we expect to see a considerable improvement in performance over PHP-GTK 1 on Windows platforms when PHP-GTK 2 finally makes it out the door.   <\/p>\n<p>Are the mysterious '98-battering APIs likely to be tangled with prior to the first Unicode release?  Could we have some kind of 'cut off date' to work toward, or does it need to be immediately after the 5.1.0 release? - I ask because PHP-GTK development traditionally is against CVS HEAD.  <\/p>","email":"http:\/\/goytalk.blogspot.com\/","url":"http:\/\/goytalk.blogspot.com\/"},{"i":"42dd7d8f-f20c-9983-8339-2dd7d8fa398d","d":"2005-07-19 22:24:15","u":"anon","n":"Kev009","c":"<b>5.1 EOL<\/b><br\/>\n<p>5.1 should be the last version with Win9x support.  When developing fat applications (read: GTK and intranet), there is no reason to update PHP versions.  Infact you'd probably want to leave it at the development version, so nothing has a possiblity of breaking.  Bugs should be irrelevant as well, considering if you did proper QA and discovered bugs they should be in the PHP bugzilla and patched before shipping your entire fat app.   <\/p>\n<p>I too run old systems, but one should not expect to run the latest software if the OS is old.  <\/p>","email":"Kev009","url":null},{"i":"42e107cb-7af8-0159-0685-2e107cb4a307","d":"2005-07-22 14:50:51","u":"http:\/\/goytalk.blogspot.com\/","n":"Steph","c":"<b>Fat applications?<\/b><br\/>\n<p>Kev009 - you misunderstood the issue.   <\/p>\n<p>Application developers using PHP-GTK to write their software, do <b>not<\/b> have the option of using an earlier version of PHP than their version of PHP-GTK was developed against.  The current requirement for building PHP-GTK 2 is PHP 5.1 or higher - AKA CVS HEAD - and there is no way of building a PHP-GTK 2 win32 binary just yet...  <\/p>","email":"http:\/\/goytalk.blogspot.com\/","url":"http:\/\/goytalk.blogspot.com\/"},{"i":"42e5842e-4576-1171-9025-2e5842e08c25","d":"2005-07-26 00:30:37","u":"anon","n":"Jonny","c":"<b>Eitherway<\/b><br\/>\n<p>First thoughts were that support needed to be kept, however now with further thought I thinking dropping it would be the best way to go. If a 9x user want's to run a new program he\/she will either have to upgrade windows, or see if the developer can provide an older version of his program using php 4.x  <\/p>","email":"Jonny","url":null},{"i":"42e6d965-5024-3583-2105-2e6d965e916b","d":"2005-07-27 00:46:29","u":"anon","n":"Emo","c":"<b>No need for me<\/b><br\/>\n<p>In previous company I used php-gtk to migrate &quot;data entry&quot; application to multiplatform. It was in ms access (vba app) connected to mysql. I rewrote it to php-gtk. Win9x was used on old machines only for data entry. Wasn't problem to move them to linux (and diskless as well), so there is no need for support win9x <b>FOR ME<\/b>. I use mainly linux.  <\/p>","email":"Emo","url":null},{"i":"42e6e1e7-1e4d-0801-0562-2e6e1e7a4989","d":"2005-07-27 01:22:47","u":"anon","n":"ura","c":"<p>I did some small applications that are used in a few companies. There are MUCH of Win98 still used in a corporative environment. When I ask a customers about Win version where the app must work, typically they answers something like &quot;we use win98, winMe, WinNT, Win2000 and WinXP&quot;.   <\/p>\n<p>So, from my point of view, support of ALL versions of Windows is a great plus for PHP-GTK - for now it does the PHP-GTK even more portable than some of Win-native tools! Why to do steps backward?  <\/p>","email":"ura","url":null},{"i":"42e731b1-6882-2901-9262-2e731b15ad0c","d":"2005-07-27 07:03:13","u":"anon","n":"udendra","c":"<b>Don't scrap it all...<\/b><br\/>\n<p>I do almost all of my development on <b>WinXP<\/b> and thats where I started coding <b>PHP<\/b> , though later on I started uploading to a <b>Linux<\/b> box which my host offers. So I'm fine with scrapping it on <b>Win98<\/b> or older versions of the OS.   <\/p>\n<p>Given the fact that most users around the world still use the <b>Win<\/b> platform mostly, I wouldn't encourage it. After all we want <b>PHP<\/b> to spread &amp; be popular don't we?   <\/p>","email":"udendra","url":null},{"i":"42e8e083-f3ac-3914-8681-2e8e083927d1","d":"2005-07-28 13:41:23","u":"anon","n":"valeriano","c":"<b>you'll lose lovers...<\/b><br\/>\n<p>hi there... i'm from brazil and i got to say this: there are LOTS of developers 'round here still using WIN98 in localhost AND production (spelling?) applications..  okay, so the XP version is nicer and you can make use of APIs and stuff... but hey, what about the others? &quot;older OS, older PHP&quot;? NO WAY...  this is an ugly ugly idea and many people don't like it...  there's no difference for XP\/2K users if you drop or don't drop WIN98 support, is there?  <\/p>","email":"valeriano","url":null},{"i":"42e99597-7ab9-2574-0819-2e995975ad7d","d":"2005-07-29 02:33:59","u":"anon","n":"Florida developer","c":"<p>Cygwin or MinGW Support May Be Viable Why not find a way of keeping some form of Win 9x support in PHP? Perhaps even Cygwin or even MinGW can be used to keep Win 9x support, if the developers absolutely insist on dropping normal Win 9x support. After all, Python and Perl have Cygwin ports and Ocaml can be built using MinGW. If it is not too difficult, it would be good to have both Cygwin and MinGW support, both builds requiring the least amount of Cygwin and MinGw libraries as possible. Having some form of Win 9x \/ Win ME support for PHP &gt;= 5.1 will help the most amount of end users and developers. As you know, PHP has become not only a very popular server-side language but also a viable desktop data-processing and scripting language. If Win 9x support is dropped, perhaps at least some developers may change from PHP to Python.  <\/p>","email":"Florida developer","url":null},{"i":"42eb4f1e-9154-4712-8780-2eb4f1e9bd20","d":"2005-07-30 09:57:50","u":"anon","n":"Arpad Borsos","c":"<p>Someone who cares about using the newest Software\/PHP should also care about using a recent OS.  <\/p>","email":"Arpad Borsos","url":null},{"i":"42ec7aaa-bea7-7727-9574-2ec7aaa10a14","d":"2005-07-31 07:15:53","u":"anon","n":"Jerry Cass","c":"<b>Windows 9x<\/b><br\/>\n<p>I noticed that W2K is included in the &quot;should it&quot; question which brought me here.   <\/p>\n<p>Mine is NTFS rather than FAT32.   <\/p>\n<p>I recently read that approximately 8 million homes and businesses use Windows 98 as their OS.   <\/p>\n<p>Just a point to consider.  <\/p>","email":"Jerry Cass","url":null},{"i":"42ed3103-b272-7455-9638-2ed3103df260","d":"2005-07-31 20:13:55","u":"anon","n":"Anonymous","c":"<b>Windowns 98 is dead<\/b><br\/>\n<p>In my opinion, Windows 98 is dead. As far as I know, Microsoft provides no more support for Windows 98. This can only mean that people using Windows 98 will have to upgrade to a newer OS soon. I say this because, those running Windows 98 shortly won't be able to run the newest games, the latest MS Office and the lastest Internet Explorer - to mention some apps. Lets not forget that there will be no more updates for Win98 bugs and security issues. In other words, I don't think it is worth the effort to keep backwards compatibility for an OS such as Windows 98 - a dead or quickly dying OS. Most Windows 98 users are what Windows 3.1 users used to be arround the time of Windows 98. So, lets keep PHP clean of &quot;unnecessary-backwards-compatibility-garbage&quot; .  <\/p>","email":"Anonymous","url":null},{"i":"42ed3522-00f0-2957-2175-2ed352232c53","d":"2005-07-31 20:31:30","u":"anon","n":"peter","c":"<b>I use win98<\/b><br\/>\n<p>I use win98 - developing, because I have it buy with my pc!   <\/p>\n<p>I think with win xp there is a slower performance on my pc.   <\/p>\n<p>I plan to &quot;upgrade&quot; on a new pc in 2nd or 3rd quartal of the next year, but I not plan to buy win xp, a new processor and more ram.   <\/p>\n<p>I plan to write scripts with php 5 in the next time, but my provider use 4.3.11 - so there is no problem yet!  <\/p>","email":"peter","url":null},{"i":"42ee748a-17ee-5643-5808-2ee748a659de","d":"2005-08-01 19:14:18","u":"anon","n":"toto@darkside.tomsk.ru\/toto","c":"<b>Use Linux<\/b><br\/>\n<p>I think a Linux is only way ]  <\/p>","email":"toto@darkside.tomsk.ru\/toto","url":null},{"i":"42ee93b0-cea4-5624-3181-2ee93b0f03cd","d":"2005-08-01 21:27:12","u":"anon","n":"Joshua Pettett","c":"<b>Nice, but probably not necessary...<\/b><br\/>\n<p>Though it's kind of embarrassing, some of our workstations around here are still using Windows 95 and 98, due to a combination of compatibility and cost reasons.  These same workstations are currently running an internally developed PHP-GTK-based app that we would like to port to PHP-GTK 2 after it becomes stable.  However, if PHP 5.0 and PHP-GTK 2 will run on 95 &amp; 98 without problems, then it may not hurt us not to be able to run PHP 5.1+ on these systems until we are able to upgrade.  <\/p>","email":"Joshua Pettett","url":null},{"i":"42eea3a2-06c0-8704-1775-2eea3a2d4030","d":"2005-08-01 22:35:14","u":"anon","n":"Karl Herrick","c":"<p>Keep it please. PHPGTK once it reaches 2.0 looks quite appealing... but not without Win9x...  <\/p>","email":"Karl Herrick","url":null},{"i":"42eef244-d967-5075-7810-2eef244f1938","d":"2005-08-02 04:10:44","u":"anon","n":"Anonymous","c":"<b>Real businesses still uses Win98 widely<\/b><br\/>\n<p>I just want to add to my opinion posted lately, there is no main question what OS is used by developers - if we can select, probably Linux would be the choice of the 90% of all developers. No, question is whether we all want to develop the apps that will be really used by a real companies. For now their choice is Windows and Win98 is still widely used in a companies. They counts their money and probably, last versions of IE and Office isn't their 1st needs, much of them uses Win98 just because all they need is start their customized applications.   <\/p>\n<p>So, it will be a thousand pities if Win98 support will be stopped.  <\/p>","email":"Anonymous","url":null},{"i":"42ef2793-fb5c-4313-3717-2ef279312af1","d":"2005-08-02 07:58:10","u":"anon","n":"techie","c":"<b>dr.<\/b><br\/>\n<p>Some commercial organizations still use  win95 workstations and p166 processors, especially in not well-developed countries, where many perspective developers are come from nowadays. Me personally think that new developers will be more attracted by .NET technology on Win systems, since Java way is wrong - i.e. PHP 5 growed up too complicated with it's OO-features for new users and they will be more attracted by .NET's technology paradigm. Win98\/W2K\/WXP support is essential, because win98 is fast desktop system and in multimedia\/gaming world it perfomance is still unbeatable in many ways. Win2k has many restrictions on direct hardware access to work as fast as win98, therefore many users choose between WinXP and Win98. I don't mind if PHP 5.1.x will drop support for win98, but not earlier than MS - i.e. ~summer of 2006.   <\/p>","email":"techie","url":null},{"i":"42f0ad8d-1233-6918-6889-2f0ad8dc4ee3","d":"2005-08-03 11:42:05","u":"anon","n":"theinsanecoder@hotmail.com","c":"<b>Mathieu Dumoulin<\/b><br\/>\n<p>Drop it. I'll tell you why, its been 3 years now that windows XP has been out and growing in popularity. A new windows for the desktop is also just around the corner for home users so that will just boast even more the percentage of windows &gt; 2000 out there.   <\/p>\n<p>Technically, a windows version is supported only for 8 years, therefore, next year, win98 will stop to be supported by microsoft and by 2008 windows ME will also stop being supported.   <\/p>\n<p>Therefore i think that with all the windows XP or 2000 out there. Further more PHP is usually a server based technology, so i doubt there would be so much GTK out there that need to go to old not supported platforms anymore.   <\/p>\n<p>So i say move on!!! PHP 4 will still be avail to use with older systems, but drop the backward compat for old systems.  <\/p>","email":"theinsanecoder@hotmail.com","url":null},{"i":"42f0b4cc-8b98-3114-4742-2f0b4cccd6a3","d":"2005-08-03 12:13:00","u":"anon","n":"kernoel@chello.at","c":"<b>Hm...<\/b><br\/>\n<p>I think Win9x support is not needed anymore. I'm writing a Windows API extension for PHP at the Moment (fairly similar to PHP-GTK, but native ;o)) and i dropped Win9x support too very early in development, because it would have ment a thousand ifdefs and version checking. Some API functions are not supported in earlier Win Version, but when using classes, i have to check the version at runtime (or deliver a spearatly copiled version) because the rest of the methods should work...   <\/p>\n<p>Just take Transparency functions as a sample: Everyone's excited when seeing some translucent rotating cube just ontop of his desktop, but when used on old versions this will either look <i>extremly ugly<\/i> (when lucky ;o)) or make everything crash.   <\/p>\n<p><b>Win9x support meens a lot of work and a lot of mess in code files...<\/b>   <\/p>\n<p>Therefor i vote for dropping it.  <\/p>","email":"kernoel@chello.at","url":null},{"i":"42f74376-acd6-6170-3428-2f743768e5c6","d":"2005-08-08 11:35:18","u":"anon","n":"Eduardo","c":"<b>PHP-GTK<\/b><br\/>\n<p>I have some clients that yet uses Win98, and I neet suport for it, because my softwares are written in PHP-GTK   <\/p>\n<p>Eduardo RBS Brazil  <\/p>","email":"Eduardo","url":null},{"i":"42fb5a58-d0a3-8718-6534-2fb5a5821375","d":"2005-08-11 14:02:00","u":"anon","n":"Beefy","c":"<b>Lots of companies rely on Win98\/WinNT<\/b><br\/>\n<p>I know lots of small\/medium sized companies which rely on Win98 and WinNT. They often have software (called &quot;Fachverfahren&quot; in german) escpacielly written for this company. A lot of this software relies on PHP-GTK or will rely on PHP-GTK2. It would be a pity to drop the Win98\/WinNT-Support in my opinion.  <\/p>","email":"Beefy","url":null},{"i":"42fba71e-7db7-3015-6492-2fba71e7a75d","d":"2005-08-11 19:29:34","u":"anon","n":"Cory Christison","c":"<b>*shrugs*<\/b><br\/>\n<p>If hardware and cost is an issue, use Linux. It has all the same capabilities and better security and stability.   <\/p>\n<p>I understand that it may require some training for those who might be using it, but what's a life without problems really worth?  <\/p>","email":"Cory Christison","url":null},{"i":"42fe929c-f8d3-2022-0945-2fe929cf3bb1","d":"2005-08-14 00:38:52","u":"anon","n":"info@erickpaquin.com","c":"<b>Keep it on!!!!!<\/b><br\/>\n<p>Versatility, Flexibility, Compatibility is all we need in this world.   <\/p>\n<p>Please don't make the mistake of removing it. Otherwise all win9x users of the future will be forced to rely once again on MS-SHIT-only technology once more.   <\/p>\n<p>Give them choices, they will come to u.   <\/p>\n<p>Erick P.  <\/p>","email":"info@erickpaquin.com","url":null},{"i":"430a9e27-81cb-2852-4661-30a9e27ecc83","d":"2005-08-23 03:55:19","u":"anon","n":"barney@centralpets.com","c":"<p>I am a programmer to develop web applications for small and medium business. As I know, many of them still are using Win98 and WinMe. So, I think it's not the right time to drop it at this moment ...  <\/p>","email":"barney@centralpets.com","url":null},{"i":"430f3517-0f81-1767-4685-30f3517953c1","d":"2005-08-26 15:28:23","u":"anon","n":"edwin@iband.net","c":"<b>Win9x is needed to grow OpenSouce customers in Colombia<\/b><br\/>\n<p>i'm from Colombia, a very hard country to develope on open source way. I and some friends have created a little entreprise to sold and develope services  like web apps, hardware and automatization instruments, using open source technologies. But the truth is , the most of people in Colombia has not a little idea  of the success of using opensource , and  the big problem is the operation system, always that we mention Linux,FreeBsd,NetBsd as a good alternative   all my customers have said no !!!. Then we had to change ours strategy  by developing on Win9x, which is the most used OS in Colombia, and programm with Php-Gtk, Gtk++, and  Firefox as web browser; then the customers began to use open source and its advantage without a complete change.   <\/p>\n<p>For this reazon my enterprise join to this comments. We need to grow the Open Source customers in Colombia, the php 5.1 support of Win9x platforms.   <\/p>\n<p>Edwin Barrios www.iband.net   <\/p>","email":"edwin@iband.net","url":null},{"i":"4311ebd4-0a33-4709-7611-311ebd4f4070","d":"2005-08-28 16:52:36","u":"anon","n":"Joe Less","c":"<b>Applications only for power users?<\/b><br\/>\n<p>We are developing Content Management Systems starting from CD-ROM (this means that the users's PC is the server), and of course Win9x is required on user's side. If PHP would not work on such computers, we had to chose another platform - sorry!   <\/p>\n<p>Win 95 support is not so important because it's really old and most PCs running with this system coud be upgraded to Win 98. But of course it would not be possible to install XP on machines with 800 MB HD, 32MB RAM etc.   <\/p>\n<p>I think professional users have not any idea how many millions of Win 9x-PCs are still in use, doing just everything their users expect from them. They are running not only at home but also in institutions, libraries, caf&eacute;s. Many professionals started programming with an oldtimer PC. Do you want to bar 50% of computer users from your applications only because they are not power users?  <\/p>","email":"Joe Less","url":null},{"i":"43134bf9-e095-6875-7275-3134bf9922ff","d":"2005-08-29 17:55:05","u":"anon","n":"O K","c":"<b>I use win98<\/b><br\/>\n<p>simply because it is sufficient for my humble purposes, and I would hate to be forced to pay for a new OS, and for the hardware that is necessary to make it run properly.  <\/p>","email":"O K","url":null},{"i":"43142c5e-8e02-8094-2263-3142c5edd008","d":"2005-08-30 09:52:30","u":"anon","n":"jason@22host.net","c":"<b>developer<\/b><br\/>\n<p>i don't think support for win98 is needed!&lt;br\/&gt; it's a good chances for every win98 user to learn linux and never buy  windows upgrade from microsoft. ^.^  <\/p>","email":"jason@22host.net","url":null},{"i":"43142c64-5080-2430-1704-3142c64b8646","d":"2005-08-30 09:52:36","u":"anon","n":"jason@22host.net","c":"<b>developer<\/b><br\/>\n<p>i don't think support for win98 is needed!&lt;br\/&gt; it's a good chances for every win98 user to learn linux and never buy  windows upgrade from microsoft. ^.^  <\/p>","email":"jason@22host.net","url":null},{"i":"4315768a-77eb-5280-7668-315768a7c664","d":"2005-08-31 09:21:14","u":"anon","n":"midhat","c":"<b>Stop php for Windows<\/b><br\/>\n<p>Its the only way to get em out of redmond scums  <\/p>","email":"midhat","url":null},{"i":"431c4e5f-561b-4215-5405-31c4e5f49483","d":"2005-09-05 13:55:43","u":"anon","n":"AP-slim","c":"<b>someone use php in win9x...<\/b><br\/>\n<p>I'm a developer and I use php under win98SE. I think that winXP is unnecessary for my need and i still use 98.  <\/p>","email":"AP-slim","url":null},{"i":"431efb7b-bdad-9613-9146-31efb7b3f20b","d":"2005-09-07 14:38:51","u":"anon","n":"Anonymous","c":"<b>Just kill it.<\/b><br\/>\n<p>If you use unsupported (by it's manufacturer), why should PHP support it?  <\/p>","email":"Anonymous","url":null},{"i":"43257aae-f182-8509-7320-3257aae822e8","d":"2005-09-12 12:55:10","u":"anon","n":"henke.andersson@comhem.se","c":"<b>What about the devlopers?<\/b><br\/>\n<p>There are many people who want to have a test server of their own and are runing win 9x. Or people who has a old pc with win9x on and want to use it as a server, but has 0 linux knowledge and 0 money for things like Nt  <\/p>","email":"henke.andersson@comhem.se","url":null},{"i":"4325e48a-0adb-8773-2032-325e48ad392e","d":"2005-09-12 20:26:50","u":"anon","n":"arias@elleondeoro.com","c":"<b>Renove or Die<\/b><br\/>\n<p>Renove or Die, if you want to use php in win9x, take a older version.  <\/p>","email":"arias@elleondeoro.com","url":null},{"i":"43293c9f-f474-6108-7991-3293c9f22d36","d":"2005-09-15 09:19:27","u":"anon","n":"Dimitri","c":"<b>YES <\/b><br\/>\n<p>Please keep it so as it is!!!! thanke you!!!  <\/p>","email":"Dimitri","url":null},{"i":"432a0039-f263-3412-2021-32a0039a3787","d":"2005-09-15 23:14:01","u":"anon","n":"Benjamin Smith","c":"<b>Think of the TEACHERS! <\/b><br\/>\n<p>I run a small software company that vends   a php-gtk app to schools in California. Schools are (unfortunately) underfunded, and it's typical to see these teachers using computers over 5 years old.   <\/p>\n<p>Although most of our userbase is running 2000\/XP, there's still a significant number of places with the P3 is &quot;the fast computer&quot; and many are still running P2 systems with Windows 9x\/ME.   <\/p>\n<p>If php didn't support 'doze, I'd have to cut off support for these teachers, requiring them to either drop our product (something I don't like) or buy new computers. (something I they wouldn't like)   <\/p>\n<p>Though my company is small, we do represent probably 100 teachers with computers running the Win9x codebase!  <\/p>","email":"Benjamin Smith","url":null},{"i":"432c7229-2d67-0340-0440-32c722985ca1","d":"2005-09-17 19:44:41","u":"anon","n":"Rodrigo Moglia (moglia@cipsga.org.br)","c":"<b>PHP Universality<\/b><br\/>\n<p>The great feature of PHP is a number of plataforms suport. the Win32 Subarch (Win98,ME) is required from my contry.   <\/p>\n<p>Im a brazilian developer, and some people and bussiness no have lot of money to purchase a WINDOWS NT,XP,2000.   <\/p>\n<p>Windows run in some older machines in case don&acute;t be suported and many slow running 2000,XP windows versions.   <\/p>\n<p>In many cases this people using win98 legalized, in cases must to be forced to use XP Pirated. this is not good.   <\/p>\n<p>And some aplications not be ported do Free  POSIX ARCH. Forcing users to keep runing windows.  <\/p>","email":"Rodrigo Moglia (moglia@cipsga.org.br)","url":null},{"i":"433ad106-ba77-9983-8311-33ad106a00b3","d":"2005-09-28 17:21:10","u":"anon","n":"Jp","c":"<b>Drop win32...<\/b><br\/>\n<p>As stated before, if you use an old OS you can't expect to run the latest software. A good example comes from Microsoft itself, as MS Office has dropped support for win98 a long way back (&gt;=OfficeXP doesn't run on win98, I believe), not to mention a whole bunch of other apps that have done the same.   <\/p>\n<p>If you don't want and\/or can't afford to upgrade you hardware, consider using another OS (perhaps a FREE one? ;) ). If that's not a viable option, then you'd have to stick to the current php-gtk.   <\/p>\n<p>You'll have to upgrade SOMEDAY anyway, so until then you'll be missing on the PHP improvements, but at least there is something you can use until then - the old [current] version.   <\/p>\n<p>  <\/p>","email":"Jp","url":null},{"i":"4340b413-9fb1-9273-6864-340b4139e3d1","d":"2005-10-03 04:31:15","u":"anon","n":"Micah","c":"<b>Not being supported by MS (9x & ME), so why should PHP?<\/b><br\/>\n<p>The only operating systems on Extended Support under the MS Lifeline is 98, ME, and W2K.  After they fall off of the MS lifeline, there should be no argument letting it fall off of yours.  I spent $200 on E-Bay to pick up a W2K Thinkpad to move my work off of my aging Win98 (First Edition: I don't even have decent USB!) Compaq, and it's been a breath of fresh air.   <\/p>\n<p>Affordability considered, old is old.  I say drop Win 9X.  It's a good idea for open source to remain flexible with other open source OS's as much as is technically possible, but paid OS's can only expect what they're given.  The week before Vista is released, I'll spring for XP when it's cheap.  Why not? (Worked for 98, didn't it?)  <\/p>","email":"Micah","url":null},{"i":"4341bd84-dfde-4945-6185-341bd84611b1","d":"2005-10-03 23:23:48","u":"anon","n":"techie","c":"<b>Winux<\/b><br\/>\n<p>Linuxoids are no better than MS itself. They just did get BG money. I do not think W98 should be abandoned - there are still many users. It is not necessary to support W95, but W98 can become Open Source one day.   <\/p>","email":"techie","url":null},{"i":"4345083e-8051-1958-2930-345083e8b423","d":"2005-10-06 11:19:26","u":"anon","n":"peter","c":"<b>no!<\/b><br\/>\n<p>There are too much people who use win9x. Me too.  <\/p>","email":"peter","url":null},{"i":"4345834c-0948-0171-1945-345834c232bf","d":"2005-10-06 20:04:28","u":"anon","n":"wseibert@hxcorp.com","c":"<b>Dropping which?<\/b><br\/>\n<p>quote &quot;There is talk on the PHP Internals mailing list about removing support for Win9x (95\/98\/2000\/ME) from PHP 5.1.&quot;   <\/p>\n<p>So, are they going to drop support for all windows platforms?   <\/p>\n<p>I currently use php5 on windows 2000 systems for work and at home...   <\/p>\n<p>Windows 9x\/ME are pretty much dead.. Micro$oft is working on gettting everyone to upgrade to XP.... forcefully...   <\/p>","email":"wseibert@hxcorp.com","url":null},{"i":"434acf7e-d4c8-4445-2178-34acf7e822b0","d":"2005-10-10 20:30:54","u":"anon","n":"Sean","c":"<p>Need Windows 2000 support at minimum, 98 would be nice  <\/p>","email":"Sean","url":null},{"i":"434e334f-842e-0700-2733-34e334f7b761","d":"2005-10-13 10:13:35","u":"anon","n":"\"robajz\" <robajz@robajz.info>","c":"<b>whau<\/b><br\/>\n<p>:) it seems to me - using win98 because newer versions are slower, using win98 because newer versions are too expensive - like M$ is doing something wrong :D ... if it were linux you'd just upgrade without  asking, true?  ... OT   <\/p>\n<p>Why not make stable php-5.1.final and php-gtk-2.1.final with support for win98 and let the others to fix bugs and make backports as they need with help of php-gtk team? php-5.2 could already be free of w98...   <\/p>\n<p>I vote for this because I would like to be able to develop php-gtk-2 apps for w98 as it becomes stable   <\/p>\n<p>:) live in peace  <\/p>","email":"\"robajz\" <robajz@robajz.info>","url":null},{"i":"43589b99-0c13-6168-4568-3589b99040b2","d":"2005-10-21 07:41:12","u":"anon","n":"abr_inin@yahoo.com","c":"<p>Hi I am having only pc with w98 but i am slowly moving towards open source technologies - (I am by profession - Finance Person - but my hobby is software - database  -client server - ) . I feel\/suggest please keep the compatibility for some more time till linux takes over - then you can drop 98\/95 etc ) Thanking you  <\/p>","email":"abr_inin@yahoo.com","url":null},{"i":"435b3860-e3ea-2976-7515-35b386031151","d":"2005-10-23 07:14:40","u":"anon","n":"Brent Newland","c":"<b>Drop it<\/b><br\/>\n<p>I develop on an XP machine (for those who complain about the price, just go download XP). I plan on fully supporting Windows 9x in a desktop application (active desktop), but I have no need of using a more recent version than 5.0.  <\/p>","email":"Brent Newland","url":null},{"i":"435e8ba6-9e48-5409-2752-35e8ba69f07d","d":"2005-10-25 19:46:46","u":"anon","n":"bonesbr@ig.com.br","c":"<b>keep it<\/b><br\/>\n<p>Hi, i&acute;m from Brasil , and here we have a lot of computers runing on win98\/2000. Don&acute;t forget , we are runing to the first world , so , until this day most of computers are cheep , and , needs to run on win98. We are working to get more rich , so , until them , please keep the support.   <\/p>\n<p>thanks.  <\/p>","email":"bonesbr@ig.com.br","url":null},{"i":"43688076-6294-2606-2572-3688076ba35c","d":"2005-11-02 09:01:42","u":"anon","n":"bonsaisor","c":"<b>keep it real<\/b><br\/>\n<p>win2k is a preferred choice by many professional windows users and win9x just performs damn good. please keep support for the old OSes, i think php is not bound to any new-ish win32 api &quot;i f**k you up if you do not upgrade your os&quot; stuff. even if it is already - it should not!  <\/p>","email":"bonsaisor","url":null},{"i":"4374ff40-c761-9372-4056-374ff4070ee5","d":"2005-11-11 20:29:52","u":"anon","n":"Anonymous","c":"<b>Removing support for windows 9x is **stronly recommended**<\/b><br\/>\n<p>most windows 9x users are not advanced so they do not use the features of latest php. they do not know what open source is. all shared webhosting providers do not use windows 9x. they could just download linux. why bother supporting 9x when an older version is available? why would an outdated windows user download something completely new? windows 9x websites are not good websites.  <\/p>","email":"Anonymous","url":null},{"i":"43823cf1-17bf-3119-1559-3823cf1b5d3b","d":"2005-11-21 21:32:33","u":"anon","n":"Mvermelho","c":"<b>KEEPING support for windows 9x is **strongly recommended**<\/b><br\/>\n<p>I see that a lot a people agree: if you are working in real world, you need win9x support. I'm so tired of programs that need .NET or XP service pack 2. I simply ignore them and use whatever works in my system. I use win98SE myself. It works, and doesn't come with virus pre-installed (messenger, RPC, media player &gt;8)   <\/p>\n<p>There are a LOT of VB6 programmers (like me) looking for alternatives. Most of them don't like VB.NET. PHP-GTK may be an alternative, and better if has win9x support.   <\/p>\n<p>Now is the time to make a decision:   <\/p>\n<p>decide to be like Microsoft (and force everybody to upgrade) or be better than Microsoft (let almost everybody run whatever operating system they have)   <\/p>\n<p>Who will have the bigger potencial user base??   <\/p>\n<p>I agree with Harry Fuecks.   <\/p>\n<p>PS. Keeping support for windows 9x is <b>strongly recommended<\/b>   <\/p>","email":"Mvermelho","url":null},{"i":"438431f7-cc76-6996-5909-38431f78f9fc","d":"2005-11-23 09:10:15","u":"anon","n":"spajus","c":"<b>hell with windows<\/b><br\/>\n<p>i believe windows 9x support is just a waste of development time and resources  <\/p>","email":"spajus","url":null},{"i":"438be025-c825-6289-4325-38be0256f851","d":"2005-11-29 04:59:17","u":"anon","n":"ronzamud@yahoo.com","c":"<b>We need the support for PHP-GTK2<\/b><br\/>\n<p>Yes, some GUI clients could be Win98 so we still need the support for those OSes.  <\/p>","email":"ronzamud@yahoo.com","url":null},{"i":"4394bf44-5178-2473-5997-394bf44e9085","d":"2005-12-05 22:29:24","u":"anon","n":"Anonymous","c":"<b>1<\/b><br\/>\n<p>bring it down... make them eat their so-called OS or learn GNU\/LINUX...  <\/p>","email":"Anonymous","url":null},{"i":"4395d22c-323d-0741-8977-395d22c17d1b","d":"2005-12-06 18:02:19","u":"anon","n":"TheCric","c":"<b>5% of the market is on win 98<\/b><br\/>\n<p>In a rich country it's easy to say &quot;go on, keep moving (and pay) to a new OS&quot;.   <\/p>\n<p>In a poor country, you reuse what you can, for instance old computers that you get as help from rich countries.   <\/p>\n<p>If you are poor and can't afford new computer  maybe Open Source can help you to discover new software and technics even on old computers.   <\/p>\n<p>Moving to Linux is not really a solution, 1% of computers are linux based. 5 times more are Windows 98.   <\/p>\n<p>Riches can afford many computers, virtual machines etc, some on linux as servers or geek machines and so on, but poor can't afford that.   <\/p>\n<p>... Don't let poor on the roads.  <\/p>","email":"TheCric","url":null},{"i":"43a2c27c-d8ee-5617-6310-3a2c27c71899","d":"2005-12-16 13:34:52","u":"anon","n":"ravago@gmail.com\/Ravage","c":"<b>Acceptance of PHP applications rests on end users on Win98<\/b><br\/>\n<p>We need to keep PHP as versatile as possible to as many client platforms. True the project proponents will have servers, but end user clients will still be running win9x machines. There are many that can benefit from PHP applications, but cannot and need not upgrade to higher operating systems either because of cost or their hardware cannot support the new OS.   <\/p>\n<p>We're building an interesting app that will collect and deliver golf handicap scores to golf courses around the country with a central PHP website. Our remote app will be a PHP-GTK application.  <\/p>","email":"ravago@gmail.com\/Ravage","url":null},{"i":"43a41a0d-3803-5054-9826-3a41a0d674c0","d":"2005-12-17 14:00:45","u":"anon","n":"lsmartinez@gmail.com","c":"<b>Win 9x don't dies<\/b><br\/>\n<p>It's yet difficult to many users migrate to win NT-5 aka 2000, XP, 2003, esentially in Latin America because is so expensive to many people here. I think that putting more support for this can improve the massification and use; with time, more develop tools will came and this can accelerate php usefullness in client applications. I'm a user of Linux, where php-gtk runs very good, developing more plattform independent tools for mod_php, php-cli and php-gtk and I have only Win98 don't want to change it, I need it for test and release this tools, with the final goal to convince people for using Linux.  <\/p>","email":"lsmartinez@gmail.com","url":null},{"i":"43cc5f9d-d615-1125-6829-3cc5f9da124e","d":"2006-01-17 03:08:13","u":"anon","n":"KnightAR","c":"<b>2k<\/b><br\/>\n<p>I use Windows2000 and refuse to upgrade, so keeping at least Win2k support would be great.  <\/p>","email":"KnightAR","url":null},{"i":"43e1b3b5-e3ba-3948-1575-3e1b3b5a34cf","d":"2006-02-02 07:24:37","u":"anon","n":"Hunter","c":"<b>PHP and win9x<\/b><br\/>\n<p>I must say a lot of users in the world are still using win 95\/98\/ME\/2000, even if the xp is dominent we developers should not forget the ones who are behind in the OS race...  <\/p>","email":"Hunter","url":null},{"i":"43e54e32-b41f-1608-6709-3e54e322e098","d":"2006-02-05 01:00:34","u":"anon","n":"Mr.Cheeseman","c":"<b>Practicing at home<\/b><br\/>\n<p>Disconcerting indeed.   <\/p>\n<p>I have a Win9x machine and I use it mostly for PHP testing, and it would be nice if I didn't have to change my OS just to use upcoming versions. :(   <\/p>\n<p>  <\/p>","email":"Mr.Cheeseman","url":null},{"i":"4410c924-bdcb-5512-8154-410c9245f20e","d":"2006-03-10 00:32:36","u":"anon","n":"lmiranda@gmail.com","c":"<b>\/ME<\/b><br\/>\n<p>I have win9x winxp. I use it to develop php from there. Since me and my wife and her cousin uses my pc, i can't just switch to linux and develop there.  <\/p>","email":"lmiranda@gmail.com","url":null},{"i":"4417f964-04a1-4134-3467-417f964b2d8c","d":"2006-03-15 11:24:20","u":"anon","n":"shazameenrazeek@yahoo.com","c":"<b>The Poor Masses<\/b><br\/>\n<p>Please don't take the same approach that microsoft takes by upgrading their technologies and expecting everyone else to follow suit. I think it's downright unfair. PHP, represents a dying breed of applications which provides support for Win98. It is and has always been one of the more powerful languages which support Win98. I'm a freelance small-scale web designer, and as it is, cannot afford to upgrade. And I'm sure there are many people like me outthere. Please don't deprive us of the opportunity to use such a powerful language. I'm sure you can work around some of the things and achieve the same functionality that the XP API provides. Thank you... all the best.  <\/p>","email":"shazameenrazeek@yahoo.com","url":null},{"i":"441ea8ca-6a8c-2073-6626-41ea8ca6aa93","d":"2006-03-20 13:06:18","u":"anon","n":"codeslinger at compsalot dot com","c":"<b>Win98 Support for 3 more years<\/b><br\/>\n<p>This thread is rather old, but you have not said if any conclusions had been arrived at.  So I will add my 2 cents for what's it's worth.   <\/p>\n<p><hr\/>\n  <\/p>\n<p>I am a professional developer in USA.  It has been my experience that there are a surprising number of small businesses still using win98 and even a few are using win95.   The argument (above) about MS Office is irrelevant, once people install\/pay$$ big bucks for MS Office they are not inclined to upgrade it.  But meanwhile I am trying to deliver new apps into this mixed win9x environment.   <\/p>\n<p>As a developer, one of my biggest headaches are the poor levels of compatibility between the different versions of Microsoft Windows.  This is one of the reasons I am excited by the php-gtk approach.  I know that this is a headache for you as well.  But by you tackling the problem and creating a compatibility layer, it enables developers like me to not have to spend my time fighting with compatibility.  It enables me to write a program that <b>really will run on all the target OSes.<\/b>  Better to have one team take on and solve the problem of compatibility then for every developer to have to solve these problems for every program that they write.  So yes, it is a lot of extra work and hassle for you, but you are doing a great service by the multiplier effect of saving a much greater number of programmers from having to fight the same battles.  I am also very excited about being able to transparently migrate the apps over to Linux and Mac.  (by all accounts, Java failed to deliver the promised compatibility and performance - which makes your accomplishment all the more impressive.)   <\/p>\n<p>Interestingly, one of the strongest arguments that I am able to make to people \/customers, against Microsoft and in favor of Linux is the very fact that Microsoft has abandoned them.  Microsoft has been very arbitrary in deciding what to continue supporting.  They had planned to drop support for win9x several years ago, but so many people screamed, they were forced to revise their support plans.  People\/businesses see very clearly the game that Microsoft is playing - the game of forced obsolescence and forced upgrades $$$.  People do not like this and it gives the foot in the door to get them converted into Linux.   <\/p>\n<p>Back when IBM was &quot;king of the hill&quot;, one of the things that put them there is that they always bent over backwards to maintain compatibility with older systems.  Companies make a huge investment in their software and systems.  To arbitrarily obsolete them is a huge cost and burden.  IBM understood this, but Microsoft is too arrogant to care.   <\/p>\n<p>For instance, I have 200000 lines of VB6 code that must soon be tossed.  We are talking many man years of work.  A huge cost.  All because Microsoft has arbitrarily decided that it does not make enough money from VB6 to be worth supporting it anymore.  VB.NET is not compatible and does not deserve to be called &quot;VB&quot;, it is a completely different language which happens to have many similarities to VB6, in the same way that PHP happens to be similar to C.   <\/p>\n<p>I am looking for a cross platform solution with which to replace those 200000 lines of VB6 code.  And you can bet that I am not looking for the &quot;next greatest thing&quot; from a company that is so willing to abandon it's customers in the never ending quest to force you to buy something new from them.  I am not going to be using a Microsoft based solution; they can not be trusted.  I am leaning very strongly towards a php-gtk 2.x  solution, but the jury is still out.  I looked at the 1.x version about 6 months ago and passed on it as being too raw yet.  I am only just now back again, to look at the 2.x to see if it is suitable.  My programs <b>must<\/b> be able to support win98; with good performance and reasonable stability.   <\/p>\n<p><hr\/>\n  <\/p>\n<p>It is also very reasonable for you to want to drop support at some point for older systems.  I feel it is fine to drop support for win95 at this point, if you have not done so already.  Very few apps try to support win95, it has too many bugs\/problems.  And win98 will run on (can be installed on) most hardware that runs win95.  As noted previously, higher OSes (win2000 and up) will not run on the older hardware. (It is also the case that win98 does not run on a lot of the newer hardware....).  Also from a business standpoint, it is generally cheaper to replace a computer then to upgrade the OS.   <\/p>\n<p>My assessment is that the win98 market in USA has about 3 years left.  Companies are slowly replacing their computers (primarily when they die, but also when they become to slow to run an essential new app), most are unwilling to jump on the Microsoft bandwagon of constant upgrades.  Consequently there are still a lot of win98 machines out there (in USA), but very very few win95.  From other people's comments, apparently win98 will continue to be around for a long time yet in other countries.   <\/p>\n<p>I think it is fine to define an End Of Life point and say okay going forward from here we no longer need to support win9x.  But please <b>do<\/b> include php-gtk 2.x  in the win98 camp, otherwise I shall not be able to use it for my development work.   <\/p>\n<p>Also, I urge you to make a full version number change and not a point number change, when you drop support for win98.  e.g. call it php-gtk 3.0  not 2.1;  you are talking about a major shift in the functionality of the program when you drop platform compatibility; version 2.x should be for bug fixes and the completion of more api's.   <\/p>\n<p><hr\/>\n  <\/p>\n<p>From a compatibility standpoint, win95 is very buggy and has lots of issues, it should be considered separately from win98.  However win95 will usually work with code written for 98, so it's just a question of how hard to try to fix any problems, I'd say that for USA, don't bother, it is already past it's time.  But perhaps for places like Columbia (see comments above) it is a different story.  (I would say that win95 users should accept that fact that they may only be able to run php 4 and gtk 1.)  I would not hesitate to tell a USA company that it must replace win95 in order to run a new app.  At minimum we can turn the win95 into a dumb terminal\/thin client and run the app on a terminal\/nx server.   <\/p>\n<p>Speaking of terminal servers, win 2000 AS is still the most cost effective platform for providing remote windows sessions.  So don't expect win2000 to disappear anytime soon.   <\/p>\n<p>win98 and winME should be considered virtually identical from a compatibility standpoint.  If it works on the one it should work on the other.  And as a developer, I would be content to have the cut-off to be php 5.x and gtk 2.x -- anything beyond that point does not need to be backwards compatible.  But also consider that anything beyond that point will not be used by me for development work, at least not for another 3 years.  So I would strongly want a gtk 2.x that works well and is stable, before you move onward; otherwise I must consider other options for replacing VB6.   <\/p>\n<p>I don't understand why you would consider win2000 to be in the same platform group as win9x, it is totally different, it is very much like XP as far as api's go.  We are definitely a long ways yet from the time where it would be okay to drop support for win2000.  Consider that 2005 is the first year in which win2000 was no longer sold.  Admittedly it has been a special order item, but many companies continued to order it so as to avoid\/forestall compatibility\/conversion issues. That means that there are now today win2000 computers that are less then 1 year old.  When figuring the product life cycle, you should be considering the last year that a product was sold, not the first year....  It is not correct to think of win2000 as being 5 years obsolete, my last install of a brand new win2000 machine was about 6 months ago.   <\/p>\n<p>I hope that you found this analysis to be helpful.  I am offering you my insights based on many years in the computer industry, working with many different (USA) companies.   <\/p>\n<p>-- Erik   <\/p>\n<p>  <\/p>","email":"codeslinger at compsalot dot com","url":null},{"i":"4464ad43-8649-2009-6464-464ad439d0ae","d":"2006-05-12 15:44:03","u":"anon","n":"Thomas","c":"<b>Win98SE please<\/b><br\/>\n<p>Hi, I STILL use Windows 98 for development. Its much faster than XP on my poor 128 Mb ram system. Agreed I do have a tuned up XP (using NLite), but still I do a lot of programming in Win98 SE. Windows 95 is too old and is not supported by PHP anyway, but I think you should support Win98SE and Win2k.   <\/p>\n<p>Thomas  <\/p>","email":"Thomas","url":null},{"i":"44674a9c-51d4-9156-5516-4674a9cc9890","d":"2006-05-14 15:19:56","u":"anon","n":"Ado","c":"<b>Mr<\/b><br\/>\n<p>most businesses will have upgraded from WinNT to W2k as thier servers and will still won't have agreed to move to w2003  <\/p>","email":"Ado","url":null},{"i":"448ff6f7-4cb1-3024-6240-48ff6f747c5e","d":"2006-06-14 11:45:59","u":"anon","n":"alec dot wood at amkotron dot co dot uk","c":"<b>9x leave it behind but not 2k<\/b><br\/>\n<p>I guess there comes a time when we've all got to move on. Every time you use a legacy OS you must accept that there will be some stuff around which won't run on it anymore.   <\/p>\n<p>The big issue I would have thought is the maintenance of security pathces, but I would have expected that there are enough talented peoiple in the PHP world to keep them coming.  <\/p>","email":"alec dot wood at amkotron dot co dot uk","url":null}]