[{"i":"462cc0f2-5fb3-4776-6596-62cc0f2db11c","d":"2007-04-23 14:21:38","u":"momo@php.net","n":"moshe at icomsw.com","c":"<b>lets took up the gauntlet <\/b><br\/>\n<p>Maybe i'm off topic here, but since there is no much traffic here lets try:   <\/p>\n<p>We on http:\/\/www.icomsw.com\/ have some crm and erp applications.   <\/p>\n<p>When we was looking for reasonable model that will allow our applications run out of the office, mean on windows mobile hardware (aka pocket or smartphones), we just found that the traditional web programming that assuming the customer is online, can't do the job in most of cases (most of places and customers - here in israel and worldwide)   <\/p>\n<p>The chosen model was using local web server on each PDA that will synchronize itself against the application while online. Now all we have was to choose the web server and scripting language ....   <\/p>\n<p>Web server: The native choose was IIS for WINCE.   <\/p>\n<p>Scripting: ASP.NET is not working on WINCE5.0 PHP - there is http:\/\/mobileleap.net\/hph\/ but we can't trust on quite unmaintained, close code produced by unknown small company who shift only half year demo. ASP - look like default no?   <\/p>\n<p>But we quickly learnt that: 1. The documentation and the accumulated experience with IIS on WINCE is poor! 2. The hardware vendor (HP and so on) are the absolute authority that can make any PDA containing the ASP\\\\IIS into his hardware 3. There is no real world thing you can realy run on naked ASP- e.g, sqlite who have quite stable port for WINCE and we want it as the local database.   <\/p>\n<p>What we did? We just port our WINCE PHP port  (you can call it PHPCE if you like) with the CGI sapi. That took us more then 8 programing mounths due to our lake of familiarity with both PHP internals and WINCE internals but after all, the delay was realy worthwhile since our simple php developers, our windows base php development and testing environment and the developers and most of the code itself was saved and we discovered huge new market ....  <\/p>","email":"momo@php.net","url":null,"did":"51534017"}]