[{"i":"44d95244-18ce-1646-7276-4d95244142ea","d":"2006-08-09 03:11:00","u":"anon","n":"Andrew van der Stock","c":"<b>Check out some of the iSync info for v3x<\/b><br\/>\n<p>Hi Wez,   <\/p>\n<p>I had to muck around for an iSync plugins for the v3x before it was officially supported. There seems to be a community out there looking at SyncML and iSync all the time, so they might have the pointers you're looking for.   <\/p>\n<p>Andrew  <\/p>","email":"Andrew van der Stock","url":null},{"i":"44d98421-4bdf-5174-2451-4d98421499c2","d":"2006-08-09 06:43:45","u":"anon","n":"Jordi","c":"<b>Provider dependant<\/b><br\/>\n<p>It seems that it's one of the features that has to be supported on the network. If the provider does not support it, it isn't on the phone (SIM card): http:\/\/www.motorola.com\/motoinfo\/product\/details.jsp?globalObjectId=95   <\/p>\n<p>(...) - Over the air synchronization with the PC via SyncML<b> <\/b>(...) <b>Certain mobile phone features are dependent on the capabilities and settings of your service provider\u0092s network.  Additionally, certain features may not be activated by your service provider, and\/or their network settings may limit the feature\u0092s functionality.  Always contact your service provider about feature availability and functionality.  All features, functionality and other product specifications are based upon the latest available information and are believed to be accurate; however such product specifications are subject to change without notice or obligation. <\/b> <\/p>","email":"Jordi","url":null},{"i":"44f5ddff-9e43-3260-8896-4f5ddff4df1f","d":"2006-08-30 18:50:39","u":"anon","n":"alopez426@gmail.com","c":"<b>Flash version dependant<\/b><br\/>\n<p>This feature is one that providers enable or disable, but you can enable it via SEEM editing, I really do not know how to do this but I can point you to this site (http:\/\/www.mark-world.tv\/motorola\/page6.html)  and hope that you can figure it out.  <\/p>","email":"alopez426@gmail.com","url":null},{"i":"44f70f1a-e0bb-5347-7395-4f70f1a82073","d":"2006-08-31 16:32:26","u":"anon","n":"jmorgie@iname.com","c":"<b>confusing too<\/b><br\/>\n<p>I am also looking for a phone to do SyncML.   <\/p>\n<p>Yahoo claims that it can sync contacts with the t-mobile RAZR.  T-Mobile support says that their spec page on the RAZR says NO in the SyncML box.  support did say thaat the PEBL does indeed do SyncML.  <\/p>","email":"jmorgie@iname.com","url":null}]