[{"i":"43b8fdaa-945c-8057-8444-3b8fdaa0c131","d":"2006-01-02 10:17:14","u":"anon","n":"admin@clientexec.com","c":"<b>Grow up<\/b><br\/>\n<p>Why so mad? Just don't be bothered by those remarks. It's only the assholes who speak out, all the others are silent and really content with what you do.  <\/p>","email":"admin@clientexec.com","url":null,"did":"51534231"},{"i":"43b96f5a-1384-5493-4913-3b96f5a94f30","d":"2006-01-02 18:22:18","u":"anon","n":"dude@example.com","c":"<b>Right On<\/b><br\/>\n<p>People with zero social skills and zero life (who hide behind a diagnosis of asperger's) are the ones most likely to be snarky to other developers, disregarding the depth and length of your contributions.   <\/p>\n<p>You're very important to the community and I wish you understood that the silent majority appreciates your work.  Those people you've mentioned should STFU, but in the long run are pathetic individuals and whose comments are insignificant.  <\/p>","email":"dude@example.com","url":null,"did":"51534232"},{"i":"43b98ec0-3ce2-3268-2490-3b98ec047479","d":"2006-01-02 20:36:16","u":"anon","n":"Richard Thomas <lists[at]cyberlot.net>","c":"<b>A Personnal Thanks<\/b><br\/>\n<p>It may not mean much but I would like to thank you for your work in the past year on PDO and also the number of times you have helped me track down problems within pdo.   <\/p>\n<p>Instead of ignoring my issues because you couldn't replicate them you took the time out of your day to log into my server and do some local testing that got to the root of a couple problems.   <\/p>\n<p>Thank you for all your time and great efforts.  <\/p>","email":"Richard Thomas <lists[at]cyberlot.net>","url":null,"did":"51534234"},{"i":"43b9d1a0-edf7-5691-0390-3b9d1a073417","d":"2006-01-03 01:21:36","u":"anon","n":"christian@vaneeden.ca","c":"<b>I Second<\/b><br\/>\n<p>I would like to second, Richard's comments. You have done an awesome job on the PDO and everything PHP related. Thank you for all your efforts.  <\/p>","email":"christian@vaneeden.ca","url":null,"did":"51534235"},{"i":"43b9e000-911c-8185-8673-3b9e0006c3f5","d":"2006-01-03 02:22:56","u":"anon","n":"Andi Gutmans","c":"<b>You are great!<\/b><br\/>\n<p>You are definitely one of the brightest and most dedicated part of PHP's development team. You should just ignore these people, who for some reason don't appreciate how much you've done and are still doing for PHP. There are always people who will rant about others to make themselves feel better.  <\/p>","email":"Andi Gutmans","url":null,"did":"51534238"},{"i":"43b9e17c-7433-5163-0867-3b9e17c1aa93","d":"2006-01-03 02:29:16","u":"anon","n":"marcus@marcuswhitney.com","c":"<b>You Da Man<\/b><br\/>\n<p>And everyone knows it Wes.  There are always those shmucks who run there mouth, but bottom line is that without your contributions to PHP, I probably wouldn't be using it.  Streams, PDO?  Hello????   <\/p>\n<p>Gotta be kidding.   <\/p>\n<p>- M  <\/p>","email":"marcus@marcuswhitney.com","url":null,"did":"51534239"},{"i":"43babb18-0167-3227-4977-3babb1884288","d":"2006-01-03 17:57:44","u":"anon","n":"Gavin M. Roy","c":"<b>Thanks for all you do<\/b><br\/>\n<p>Wez, I've been using PDO since very early on and am a big fan of the work you've done there.  I really appreciate all your efforts there and hope you don't decide to let a couple of unappreciative people ruin all  the good will you've built up in the PHP community.   With these two people being your only detractors, you should let it roll off you like water off a ducks back.  You've done great work for the community, great work for PHP, and you should be very proud of all that you've done.   <\/p>","email":"Gavin M. Roy","url":null,"did":"51534241"},{"i":"43bd9409-bf8b-8376-1572-3bd9409cfe6a","d":"2006-01-05 21:47:53","u":"anon","n":"Anonymous","c":"<p><b>Buhuu<\/b> <b>snif<\/b> <b>bitchmoan<\/b> <b>snif<\/b> <b>thebigboystookmytoysandbeatmeup<\/b> yadda yadda.. what a whiner.  <\/p>","email":"Anonymous","url":null,"did":"51534242"},{"i":"43d10d7b-26b5-8235-5142-3d10d7bd6fbc","d":"2006-01-20 16:19:07","u":"anon","n":"kenneth himschoot","c":"<b>thanks from a big community<\/b><br\/>\n<p>Hey Wez,   <\/p>\n<p>if it helps anything, thanks from a big community of developers as well. We worship you guys, so don't let any dirty mouths turn you to the dark side.   <\/p>\n<p>K.  <\/p>","email":"kenneth himschoot","url":null,"did":"51534244"},{"i":"43d12f7a-c9b2-0774-3485-3d12f7abff26","d":"2006-01-20 18:44:10","u":"anon","n":"prasanna","c":"<b>Keep going!<\/b><br\/>\n<p>Wez,   <\/p>\n<p>Sorry to hear the rant! Honestly, I have been getting paychecks out of the hard-work you guys have put as a community.   <\/p>\n<p>You know things better as an Open-source contributor and how things work in community projects.   <\/p>\n<p>All I can hope is, you will be able to resolve differences and keep moving. Guess, such things are quite common in any sort of projects and yes ofcourse, it hurts really when it is from the close-circle that you value more..   <\/p>\n<p>Cheer up and my wishes.  <\/p>","email":"prasanna","url":null,"did":"51534245"},{"i":"43ec391e-cb9d-8291-4617-3ec391e511e0","d":"2006-02-10 06:56:30","u":"anon","n":"Luke Welling","c":"<b>Analogy<\/b><br\/>\n<p>OK, so you are probably as much of a baseball fan as I am, but you might like Dave Winer (http:\/\/scripting.wordpress.com\/)'s baseball analogy (http:\/\/scripting.wordpress.com\/2006\/02\/09\/how-the-ny-times-came-to-support-rss\/)   <\/p>\n<p>&quot;Most of the vocal people on the mail lists, blogs and wikis are more fans than creators. It\u0092s as if we confused baseball players with people who sit in the stands watching a baseball game. Sure, both wear caps and want their team to win, but one actually does something about it, while the others expresses an opinion. There are a lot of fans, but relatively few people who actually do anything.&quot;  <\/p>","email":"Luke Welling","url":null,"did":"51534246"}]