[{"i":"43c00f6b-466d-1221-7178-3c00f6b08bf7","d":"2006-01-07 18:58:51","u":"anon","n":"dshlb","c":"<b>Hello Mama<\/b><br\/>\n<p>Some questions on Evildesk:   <\/p>\n<p>- Is there a way to disable thumbnails for overview (make the overview show only rectangles with symbols, no preview)?   <\/p>\n<p>- Also, can Overview be started by a clickable link instead of a hotkey?   <\/p>\n<p>- How are entries in the right click menu and the quicklaunch plugin sorted? My list goes A Z V S B 7 ...   <\/p>\n<p>- Would it be possible to make the right click menu work in such a way, that a left or right click outside of the menu cancels it?   <\/p>\n<p>Thanks!  <\/p>","email":"dshlb","url":null,"did":"51534247"},{"i":"43c1e13b-41e7-0003-4531-3c1e13be74cd","d":"2006-01-09 04:06:19","u":"anon","n":"halr9000","c":"<b>few comments<\/b><br\/>\n<p><img align=\"right\" src=\"http:\/\/halr9000.com\/images\/screenshots\/wez2.png\" alt=\"\"\/> Ok, I found evildesk a while ago, but then stopped using it when I found that it didn't pass middle-clicks through the system tray.  Glad to see that's now been fixed.   <\/p>\n<p><ul>\n<li>I had a huge quicklaunch.  Evildesk doesn't handle this intelligently, they just flow off the top of the screen, making the top ones unusable\n <li>I see a bug on the bottom of the slit.   About 4U (my new designation for &quot;icon height units) from the bottom my system tray stops, but below that is a repeat of the last 2x2 grid of icons painted over the date.  And the date repeats as well on top of itself a few times until it reaches the bottom of the screen.   I wasted all this time typing this before I realized I could inline images.  How cool of a blog feature. :)\n <li>There might be some other tray icon bugs, I'm not positive yet, will report back.\n   <\/ul>\n<p>Anyway, I'll keep it up, read the docs, see what all it can do now.   <\/p>\n<p>P.S. I don't think you suck for taking the holidays off of PHP work.  Ungrateful leeches!  <\/p>","email":"halr9000","url":null,"did":"51534248"},{"i":"43c1e2a8-934c-0297-0695-3c1e2a8dc3e8","d":"2006-01-09 04:12:24","u":"anon","n":"Uncle Remus","c":"<b>On the contracemetary<\/b><br\/>\n<p>I think leeches suck.  <\/p>","email":"Uncle Remus","url":null,"did":"51534250"},{"i":"43e31657-66d1-9710-9042-3e31657ba5e4","d":"2006-02-03 08:37:43","u":"anon","n":"drmullikin@yahoo.com","c":"<b>Awesome!<\/b><br\/>\n<p>This thing rocks, finally a desktop that cuts out the crap!   <\/p>\n<p>Little rough around the edges, it can be crashed by trying to click away from the right click context menu a few times.. happend to me at first, it's touchy.   <\/p>\n<p>Where's the forum? I'm sure this will have or does have a following.  <\/p>","email":"drmullikin@yahoo.com","url":null,"did":"51534252"},{"i":"43fe1fd8-d52b-3098-0663-3fe1fd8e1a27","d":"2006-02-23 20:49:28","u":"anon","n":"hoshi@tele2.fr","c":"<b>Evil Desktop and .lnk<\/b><br\/>\n<p>Don't know if it's me or evil destktop, but, for me, it's really great job that just don't work because of an annoying bug : .lnk, shorcut in windows, are not reconized !!! So, quick launch don't work, start menu don't work, .... So, a bit useless if I can't use shorcuts   <\/p>\n<p>But, I really try\/use many OS and desktop, and this one is really nice...   <\/p>","email":"hoshi@tele2.fr","url":null,"did":"51534253"},{"i":"c71bd89c-8adc-4eff-9340-2a1c0808261f","d":"2007-10-21 18:54:20","u":"anon","n":"http:\/\/www.danhulton.com\/","c":"<b>Tranparencies?<\/b><br\/>\n<p>Is there any way to disable the transparency effects in the slit and switcher?  I have kind of a weak videocard (impressive when I bought it, not so much now...) that really hates transparencies over certain windows (*cough*game windows*cough*).<\/p>\n<p>Is there any setting I can change to disable tranparency effects?<\/p>","email":"http:\/\/www.danhulton.com\/","url":"http:\/\/www.danhulton.com\/","did":"51534255"},{"i":"48b82b0a-aa78-4773-a612-6a880808261f","d":"2008-08-29 12:59:54","u":"anon","n":"Kurtis Holsapple","c":"<b>Broken Links<\/b><br\/>\n<p>I have been running a linux only system for quite some time now.  I now have been using WinXP at work again and felt rather uncomfortable.  Remembering how much this helped me feel &quot;at home&quot;, I came to download it and all the download links are broken... ?  where can i get this again?  is it still available?<\/p>","email":"Kurtis Holsapple","url":null,"did":"51534257"},{"i":"c8b83b94-e240-4704-8374-285f0808261f","d":"2008-08-29 14:10:28","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>Links fixed<\/b><br\/>\n<p>Sorry, some bits got mangled when the site was moved between servers; the downloads should work again now.<\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org","did":"51534258"}]