[{"i":"4b836211-f3e4-4f52-b3eb-43d90808261f","d":"2010-02-23 00:05:21","u":"anon","n":"Greg","c":"<p>if you can open regedit, go to HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon<\/p>\n<p>Change the Shell value to Explorer.EXE<\/p>\n<p><\/p>","email":"Greg","url":null},{"i":"42510380-8b98-8649-5992-2510380eb6f3","d":"2005-04-04 09:06:08","u":"anon","n":"pilgrim","c":"<b>Other languages ?<\/b><br\/>\n<p>It seems to be nice but do you plan to release it in others languages (such as french for myself) ? Or just leave the labels of the context menu in a plain ou xml text file ? Thanks in advance ;)  <\/p>","email":"pilgrim","url":null},{"i":"4252e31b-d435-2365-3439-252e31b20a2d","d":"2005-04-05 19:12:27","u":"anon","n":"Hatem","c":"<b>small small small<\/b><br\/>\n<p>The smallest .msi ever seen, is there any PHP inside ? :P  <\/p>","email":"Hatem","url":null},{"i":"42564c95-fc44-2559-6138-2564c95b2ff1","d":"2005-04-08 09:19:17","u":"anon","n":"aaron@wormus.com","c":"<b>Win2k<\/b><br\/>\n<p>Is there anything preventing it from running on 2k as well?  <\/p>","email":"aaron@wormus.com","url":null},{"i":"42567e0d-9a41-5907-3630-2567e0d1d6b4","d":"2005-04-08 12:50:21","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<p>I set out to make something very light weight, so I had no plans for localization.  Compare bison from a few years ago with the current release.  What's responsible for the huge increase in the package size?  Localization.  IMO, bison is the wrong tool to localize, because it's not an end-user facing application.   <\/p>\n<p>So, rather than localize the whole thing, I am going to include a per-user configuration file to allow you specify your own context menu.  It won't be xml, because xml parsers are really painful to use.   <\/p>\n<p>As for win2k, you could try running it, but I suspect that I've (deliberately) used a number of APIs that are not present on win2k.   XP Pro is the better operating system and provides a number of API level features to make things more convenient to code.   <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"42568d6f-c8a0-3637-4309-2568d6f20621","d":"2005-04-08 13:55:59","u":"anon","n":"mark.soriano@gmail.com","c":"<b>First time<\/b><br\/>\n<p>Great desktop shell, light, easy, and fast. :)  <\/p>","email":"mark.soriano@gmail.com","url":null},{"i":"4264c9bb-d770-1794-1278-264c9bba226c","d":"2005-04-19 09:04:59","u":"anon","n":"martin.johnstone@gmail.com","c":"<b>:D<\/b><br\/>\n<p>This is very sweet indeed   <\/p>\n<p>love it superb job m8 :D  <\/p>","email":"martin.johnstone@gmail.com","url":null},{"i":"42d35e8f-0bb6-2750-6255-2d35e8fc5225","d":"2005-07-12 06:09:19","u":"anon","n":"naubaddy@gmail.com","c":"<b>System destroyed<\/b><br\/>\n<p>OK, I've tried it... and now my (german speaking) system is not longer usable.   <\/p>\n<p>How can I get rid of your shell and set the old explorer as the standard shell? Using your &quot;reset shell&quot; does not work - the link now doesn't start the command but opens in the ascii editor.  <\/p>","email":"naubaddy@gmail.com","url":null},{"i":"42d443bf-b7c6-5467-5091-2d443bf6f2ca","d":"2005-07-12 22:27:11","u":"anon","n":"retank@gmail.com","c":"<p>Same prob here. cannot reset my desktop.   <\/p>","email":"retank@gmail.com","url":null},{"i":"42d4471a-820e-7168-0864-2d4471adcd32","d":"2005-07-12 22:41:30","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>manual removal<\/b><br\/>\n<p>\\\\EvilDesk\\\\wezdesk.exe \/uninstall   <\/p>\n<p>Should restore the registry entries and allow explorer to run as your shell again.  You should reboot after running this command.   <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"42d45554-322a-3930-9660-2d4555504417","d":"2005-07-12 23:42:12","u":"anon","n":"retank","c":"<p>start\/run\/ type in  msconfig \/ at general tab you can do a system restore.   <\/p>\n<p>Thanks for the fast reply wez. I have a low memory machine so I like trying different shells etc, and although it did run better than  it did before, gui is like an addiction. I use my desktop too much to trade it for a speedier system. Also I was never a command prompt person(not that this is a CP interface)  <\/p>","email":"retank","url":null},{"i":"42d4dfd8-e7e7-2358-9677-2d4dfd8827e4","d":"2005-07-13 09:33:12","u":"anon","n":"naubaddy@gmail.com","c":"<b>Uninstall Error<\/b><br\/>\n<p>Hi, I've restored my old system, using 1 hour of time and another computer.   <\/p>\n<p>Your uninstall doesn't erase the shell command from the registry. So every command and trick to restore the old explorer as shell went wrong.   <\/p>\n<p>At google I've found two registry keys I had to change manually to reset my system.   <\/p>\n<p>You should warn your other than english customers better not to use the evil shell.   <\/p>\n<p>E.G. in germany &quot;Start Menu&quot; is &quot;Startmen&uuml;&quot; (with u-umlaut). So this and a lot of other links don't work on a german (french, netherlands, polish...) system.   <\/p>\n<p>And every other link from my menu can't be opened when using evil shell. Instead of opening the link the editor opens, showing the .lnk file.   <\/p>\n<p>greetings from germany Marco   <\/p>","email":"naubaddy@gmail.com","url":null},{"i":"42d62751-1a86-5354-4701-2d62751c4679","d":"2005-07-14 08:50:25","u":"anon","n":"aso@hotmail.com\/andres","c":"<b>cuidado al desinstalar<\/b><br\/>\n<p>En xp espa&ntilde;ol parece que da problemas, yo al desisntalarlo perdi el arranque normal y solo consegui q arrancase una ventana del explorer.No sirve restaurar.La unica manera creo q es volviendolo a instalar y dejarlo.  <\/p>","email":"aso@hotmail.com\/andres","url":null},{"i":"42d83527-11f5-2432-2485-2d83527d694d","d":"2005-07-15 22:13:59","u":"anon","n":"mateni@coolkiwi.com","c":"<b>Very cool<\/b><br\/>\n<p>I like it! Having a bit of a problem with switching between tasks though. Have you thought of open sourcing it?  <\/p>","email":"mateni@coolkiwi.com","url":null},{"i":"43babd3f-2509-8254-2279-3babd3f4670d","d":"2006-01-03 18:06:55","u":"anon","n":"toffen@gmx.de","c":"<b>Registry-Entry<\/b><br\/>\n<p>Hey ho!   <\/p>\n<p>Nice Shell, working great.   <\/p>\n<p>But i have one problem: to edit the putty-plugin (also other plugins) i have to change the registry at the path [HKEY_CURRENT_USER\\\\Software\\\\Evil, as in Dr.\\\\WezDesk\\\\putty] (e.g.)   <\/p>\n<p>but there is no entry to edit. same thing at the other plugins.   <\/p>\n<p>thanks for your help, Steffen  <\/p>","email":"toffen@gmx.de","url":null},{"i":"43bb0353-02e6-5005-3424-3bb0353d3650","d":"2006-01-03 23:05:55","u":"anon","n":"lionel_hutz@springfield.com","c":"<b>...another fucked installation!<\/b><br\/>\n<p>I notice in your 'Some random notes\/comments' section you mention. &quot;On a related note, people running XP Home might not be able to launch the control panel. Tough luck, you should be running XP Pro anyway.&quot; Don\u0092t you think this is a very flippant and amateurish approach to software development, considering the amount of users that use HOME instead of PRO (the majority of users I should think)? And why do you not mention this on your download page. Perhaps you would not have so many complaints of destroyed systems. Control panel use a necessity when the p.c. screws up! You obviously have a brain so fucking use it WANKER!   <\/p>","email":"lionel_hutz@springfield.com","url":null},{"i":"43bb069a-edf8-4641-9494-3bb069a8310e","d":"2006-01-03 23:19:54","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>Lionel<\/b><br\/>\n<p>If you expect an apology after taking that tone with me, you're out of luck.   <\/p>\n<p>As for &quot;flippant and amateurish&quot;, this is a hobby project that some people find useful.  I don't get paid for this, and I'm happy that I don't, because I don't want to support assholes like you that have no appreciation for efforts of people that do things in their spare time.   <\/p>\n<p>I don't run XP Home because it's a hobbled version of Pro.  I develop only on Pro because it's what I use.  I don't have any Home systems, and I don't want to support them.   <\/p>\n<p>If you're worried about your system, you should have paid attention to the bold type on the downloads page that indicates that it is a work in progress.   <\/p>\n<p>In fact, if you're that worried about your system, why the hell are you downloading software that replaces part of your system from some dude on the internet in the first place?  <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"44cba164-f252-8069-1034-4cba164e38be","d":"2006-07-29 17:56:52","u":"anon","n":"Mike Winger","c":"<b>XP Home Not Supported<\/b><br\/>\n<p>Alright, i'm glad someone got pissed and sent a flame latter, lol.. stopped me from doing the same thing.   <\/p>\n<p>however stating that people should be running xp pro, the way you said it kinda pisses people off. possibly if you just switched that to saying that since you run xp pro you are not developing support for home? it wouldn't make people angry.   <\/p>\n<p>i'm a developer on xp home, what api(s) are you using to call control panel in pro? maybe i can find an alternative for you that you could include or something so that people with home would be able to use your software  <\/p>","email":"Mike Winger","url":null}]