[{"i":"43b22e31-7449-0430-7736-3b22e31cbf03","d":"2005-12-28 06:18:25","u":"anon","n":"Snowkrash","c":"<b>I am a Dutchie<\/b><br\/>\n<p>Hi Wez,   <\/p>\n<p>I am curious about your EvilDesk and heard some good things about it.   <\/p>\n<p>Unfortunately, I also heard that non English versions of XP don't like EvilDesk so much and installing EvilDesk on these OS's causes problems.   <\/p>\n<p>Will EvilDesk support non English XP versions?  <\/p>","email":"Snowkrash","url":null,"did":"51534285"},{"i":"43b230c4-0b2f-7117-0610-3b230c493798","d":"2005-12-28 06:29:24","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>It might work<\/b><br\/>\n<p>I'm reasonably sure that it will work.  You might prefer to maintain your own Dutch version of the .evdm file (unless you're happy with the britishisms in my default config).   <\/p>\n<p>My suggestion to anyone that is unsure whether it will work is to install the MSI file, then create a new dummy user account; login as that user and then change the shell to evildesk.  Give it a whirl, and if it seems to work out, you can adopt it for your main user account.   <\/p>\n<p>If it doesn't work out, let me know, and I'll see about fixing it (you might need to wait a little while for a fix though, depending on the pace of my life).   <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org","did":"51534287"},{"i":"43b3b54f-1879-6195-8199-3b3b54fb570f","d":"2005-12-29 10:07:11","u":"anon","n":"pitkon@altecnet.gr","c":"<b>Skins<\/b><br\/>\n<p>Looks promising, Wez, thanx for the effort! Question #1: Many of us already have a shell switcher\/manager. Don't u think evildesk should be in exe format, without registry tweaking? Question #2: Is it skinnable? Thanx and keep up the good work!  <\/p>","email":"pitkon@altecnet.gr","url":null,"did":"51534288"},{"i":"43b4046c-5368-6578-6515-3b4046c58c8b","d":"2005-12-29 15:44:44","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>It is an .exe<\/b><br\/>\n<p>So it should be compatible with shell managers.  However, the installation assumes that you don't have a shell manager already.   <\/p>\n<p>My suggestion is to install evildesk, then install the shell manager; just tell the shell manager to run &quot;wezdesk.exe \/runstartup&quot;.   <\/p>\n<p>As for skinning, I want to avoid a full blown skinning engine (see http:\/\/www.livejournal.com\/users\/jwz\/123070.html?thread=521918#t521918). However, my current development version allows you to specify a background image for the task switcher and slits, along with some other eyecandy goodies (carefully balanced with low resource consumption; that's my main goal)   <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org","did":"51534289"}]