[{"i":"cb8fbeca-c390-4c34-956a-43e30808261f","d":"2010-03-04 09:08:10","u":"","n":"rumi.kg","c":"<b>State of affairs<\/b><br\/>\n<p>Hi Wez<\/p>\n<p>Thank you so much for putting this up. I&#039;m currently investigating how to implement my own &lt;a href=&quot;http:\/\/pastebin.com\/613mFGsB&quot;&gt;PHP meta language&lt;\/a&gt; and was just wondering if your lemon-php and JLexPHP are &quot;done&quot; in the sense of being ready to implement a full programming language in?<\/p>\n<p>Thx for your time!<\/p>\n<p>Rune<\/p>","email":"rumi.kg","url":null},{"i":"4be1c908-8684-4678-a803-43e10808261f","d":"2010-05-05 15:37:44","u":"anon","n":"Jgetner","c":"<b>your parser builds<\/b><br\/>\n<p>i have spent countless hours to try and get your parser and lexer to work but i can&#039;t seem to be able to accomplish this i have gotten the C to compile but no clue how to compile jlexphp or what exactly you mean by defining the lexer file and in what way.<\/p>\n<p>please email me at Jgetner@gmail.com<\/p>\n<p>i do have a strong understanding of php and a grasp of C but java im completely clueless<\/p>\n<p>thank youf or your time. <\/p>","email":"Jgetner","url":null},{"i":"456871a0-48a9-8560-6605-56871a0e8524","d":"2006-11-25 16:38:56","u":"http:\/\/greg.chiaraquartet.net\/","n":"Greg Beaver","c":"<b>PHP_ParserGenerator\/PHP_LexerGenerator already exist<\/b><br\/>\n<p>Hi Wez,   <\/p>\n<p>http:\/\/pear.php.net\/PHP_ParserGenerator http:\/\/pear.php.net\/PHP_LexerGenerator   <\/p>\n<p>Both have been available since June.  PHP_ParserGenerator is a pure PHP port of lemon, and PHP_LexerGenerator is a from-scratch lexer generator which is similar to Marcus's re2c   <\/p>\n<p>Would have saved you a lot of trouble if you had googled &quot;php parser generator&quot; first :)   <\/p>\n<p>I hope these are useful for you  <\/p>","email":"http:\/\/greg.chiaraquartet.net\/","url":"http:\/\/greg.chiaraquartet.net\/"},{"i":"456880f0-b6f9-5136-6477-56880f0f005d","d":"2006-11-25 17:44:16","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>it was no trouble<\/b><br\/>\n<p>I had my port of lemon for a couple of years already (since before I moved to the USA), so the only part I was missing was the lexer generator, and that only took me a couple of hours.   <\/p>\n<p>I did google and did find your bits; no disrespect to your efforts, but the lexer code in JLex has been around for years.  I'm wouldn't be surprised if there are still a few edge cases in your code that were shaken out of JLex a while ago.  Again, I'm not calling your code bad, it just seems better to me to invest a couple of hours in porting known good code rather than a couple of days to hit an edge case.   <\/p>\n<p>That's just me; I'm not seeking to discourage others, just publishing something that might be useful.   <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"ca4b4b9a-3d44-46cf-a21e-0e670808261f","d":"2009-07-01 07:42:18","u":"anon","n":"Anonymous","c":"<b>Thx Greg<\/b><br\/>\n<p>After spotting your work in this post a <\/p>\n<p>couple of weeks ago, i&#039;ve had a lot of<\/p>\n<p>fun creating my own little DSL for<\/p>\n<p>a project i&#039;m doing. Thx a lot!<\/p>","email":"Anonymous","url":null}]