[{"i":"44ee01be-0ea5-0479-2753-4ee01bea59da","d":"2006-08-24 19:45:02","u":"anon","n":"Santosj","c":"<b>Fair Comparisons<\/b><br\/>\n<p>Why not do them yourself? Or if you have done them, then I'll look over your posts to see if you have posted speed results.   <\/p>\n<p>I'm sorry, once &quot;better&quot; speed comparisons come out then I'll be less likely to say that PDO is slow. If I did them, then it would be primitive with simple microtime, which wouldn't exactly be accurate or fair.   <\/p>\n<p>I don't think my post or possible speed decreases are going to keep people away from PDO.   <\/p>\n<p>My post was simply trying to state that what SDO currently offers has been widely covered in PHP. That it is going to take time before it is widely used. Finally, that developers would be more inclined to use PDO over SDO for their applications.   <\/p>\n<p>As a final note, I have to use what information is available and the benchmarks is a good one, so I used it. While I do know about the emulate prepared statements, it seems kind of foolish that one would have to use that. If it is faster and better, then why even have native prepared statements?  <\/p>","email":"Santosj","url":null,"did":"51534129"},{"i":"44ee068b-96da-8813-5879-4ee068bedaa8","d":"2006-08-24 20:05:31","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>effort<\/b><br\/>\n<p>Why have prepared statements if they're sub-optimal?  Ask the folks at MySQL.  They'll get better one day, I'm sure, but they're apparently not quite up for prime-time just yet.   <\/p>\n<p>The point I was trying to make was that, rather than relying on one other persons (possibly flawed) benchmarks to form and spread the opinion that &quot;PDO is slow&quot;, you should measure the performance for yourself, for the kinds of things that you're doing.   <\/p>\n<p>Your comments here imply that you haven't done any benchmarking for yourself, or that you haven't tried very hard to find existing benchmarks.  IMO, it's better to come out and say that up-front and point people at the source of your information when you blog, otherwise you are building up a web of misinformation, and it is <b>that<\/b> that I'm objecting to.   <\/p>\n<p>Why haven't I done benchmarking?  I think I'm doing enough for PHP in the time I can find for it right now.  There's only one me, but there are plenty of people out there, like you, that could build up excellent blog content by sitting down and putting a bit of effort into it.   <\/p>\n<p>+1 for factual rather than anecdotal content.   <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org","did":"51534131"},{"i":"44ee0bc7-c389-0568-5547-4ee0bc77ede1","d":"2006-08-24 20:27:51","u":"anon","n":"SantosJ","c":"<b>Hmm, Sorry then<\/b><br\/>\n<p>I'm sorry if I always appear to come off as &quot;PDO is bad, don't use it,&quot; because I have a lot of admiration for what PDO allows developers to do. I should write a post about why I do enjoy PDO, but I haven't really gotten around to it.   <\/p>\n<p>I don't think about writing about stuff that I appreciate. The only reason I wrote about SDO was because I have heard so much discussion about SDO but no one really stated that the features are already offered in PHP.   <\/p>\n<p>Actually, for me personally, using PDO was an considerable speed increase over my own object database access abstraction layer. Which is to only prove how much of a n00b I am, but oh well. I did write about that or a snippet of it at least.   <\/p>\n<p>I would say that going from about 1.5 seconds to .5 seconds was considerable increase. Site now preforms at .1 seconds, but I'm not going to spend the time to make it any faster.   <\/p>\n<p>Oh, I also removed the section about the direct access, the entire paragraph really wasn't I wanted to say. I also added in your points to not totally put hate on about PDO.  <\/p>","email":"SantosJ","url":null,"did":"51534134"},{"i":"44ee0dcf-2a25-0412-4347-4ee0dcf7727c","d":"2006-08-24 20:36:31","u":"anon","n":"SantosJ","c":"<b>Anecdotal Was the Intention<\/b><br\/>\n<p>The original title was &quot;Opinion: Why SDO Doesn't Take Off&quot;, but I removed the &quot;Opinion&quot;.  <\/p>","email":"SantosJ","url":null,"did":"51534135"},{"i":"44ee3da1-4a1d-9308-3497-4ee3da14865d","d":"2006-08-25 00:00:33","u":"anon","n":"Ilia Alshnetsky","c":"<b>PDO is not that bad<\/b><br\/>\n<p>While PDO cannot compete in speed against the mySQL extension with a bit of setting tweaking in pdo_mysql it is possible to make it quite a bit faster then mysqli. In fact when properly tweaked it is only 5-6% slower then ext\/mysql\/. And in some cases it is possible to make it match in speed (instances where shortcut functions such as fetchColumn() and alike are being used).  <\/p>","email":"Ilia Alshnetsky","url":null,"did":"51534136"}]