[{"i":"4276225c-4946-1357-5788-276225ca86b3","d":"2005-05-02 12:51:40","u":"anon","n":"Anonymous","c":"<p>Yeah, that's Nathaniel Brown in Vancouver. He seems to have hijacked the user group's conference there as well.  Avoidance seems like the best strategy at this point.  <\/p>","email":"Anonymous","url":null},{"i":"4283c91f-089d-1373-0264-283c91f66dfe","d":"2005-05-12 21:22:39","u":"anon","n":"Nathaniel","c":"<b>Why things were done the way they were<\/b><br\/>\n<p>I appreciate the comments and bringing this to my attention Wez. Your public display however seems quite unprofessional. I had accidentally subscribed you to the General announcements newsletter at the same time as the Call for Participation newsletter.   <\/p>\n<p>I had originally thought you would appreciate someone adding you to get announcements to upcoming events which you may be interested in speaking at. As most speakers enjoy being notified of such engagements, whereas you seem to be one of the few that takes a quite opposite approach.   <\/p>\n<p>In any case, I apologize again for the emails which you accidentally received.   <\/p>\n<p>With regards to the anonymous user who had commented regarding me &quot;hijacking&quot; the user group's conference. This seems like a good as place as any to clear up that misconception.   <\/p>\n<p>I have been attending the Vancouver PHP User Group\u0092s since the first meeting, and have contributed a number of hours proposing new ideas and provided support with things such as designing a new website, being a core contributor with the first conference, and countless other engagements. This is something that I had enjoyed doing and was completely comfortable donating my time for the wealth of the cause.   <\/p>\n<p>However, during the organization period last for the conference in January, I found myself taking lead organizing the conference. When I had asked for other peoples support, nobody replied. I had to send a direct email of disappointment with the support I had witness before anyone showed up to the conference organization meeting.   <\/p>\n<p>Honestly, at that point I was fine with the way things were going, I had finally managed to attract some support from a handful of people assisting with discussing the first conference and making some decisions (two of which were board members). This meeting was excellent, we had pretty much nailed most of the questions I had remaining and had solidified our approach to the conference. Shortly after this groundbreaking meeting and show of support, another group of board members who did not attend the meeting and had no idea why the decisions were made, decided to veto core decisions that were made at this meeting, without any inquiry as to why, just that their ideas were the only way to go, and take the conference in there own direction. When this happened, I was not pleased. I had spent numerous hours and involved myself a great deal to make this conference a success and it so happens happen I was being overran by board members who felt like going on a power trip.   <\/p>\n<p>I had discussed this with them at a further meetings and I was displeased to say the least. This resulted in me continuing my efforts for the conference under the new name, OSEvents.   <\/p>\n<p>I must also give respect to one or two board members who did show their support. It wasn\u0092t the entire group that was taking this totalitarian stance. The couple of board members were quite helpful and tried to mend things, but there was quite the polarity of others who did not even apologize when confronted at the meetings.   <\/p>\n<p>As I am not a board member of the association, my actions were being treated as that of a pawn, and I for one did not respect their unappreciative response for my efforts to have me put the time and effort to organize the event and lay the groundwork to have it uprooted by people who had not lifted a finger, but yet were able to point that finger and tell me what to do. I surely know you would not either.   <\/p>\n<p>I apologize for making this public, but having this blog and this comment come up second on Google\u0092s search results only feels like the best place to bring this to surface.   <\/p>\n<p>Regards, Nathaniel.  <\/p>","email":"Nathaniel","url":null},{"i":"42866215-390c-4656-9671-2866215d7bcd","d":"2005-05-14 20:39:49","u":"anon","n":"Anonymous","c":"<p>So you had a disagreement with the board and decided to hijack the conference instead of working out the differences. And no, most speakers most definitely do not like being auto-subscribed to mailing lists without their consent.  <\/p>","email":"Anonymous","url":null},{"i":"42ce2d00-311d-7428-4654-2ce2d0056bb0","d":"2005-07-08 07:36:32","u":"http:\/\/derickrethans.nl\/","n":"Derick Rethans","c":"<b>auto subscribe<\/b><br\/>\n<p>You can say whatever you want, subscribing people to a mailinglist without their consent is just as bad as spamming. It's a definite no no.  <\/p>","email":"http:\/\/derickrethans.nl\/","url":"http:\/\/derickrethans.nl\/"}]