[{"i":"445ebebd-d64a-3622-9471-45ebebd41547","d":"2006-05-08 03:45:01","u":"anon","n":"Sara Golemon","c":"<b>Ditto that!<\/b><br\/>\n<p>Cal Berkeley has been doing this for years ( http:\/\/calnet.berkeley.edu\/developers\/ ) and I <b>love<\/b> it.  Hooking into the campus' authentication system and getting profile data from LDAP after that takes a couple lines of code and saves a mountain of work on every new app.   <\/p>\n<p>Ditto the interrest in looking for Yahoo or Google to step up in this arena.  <\/p>","email":"Sara Golemon","url":null},{"i":"445ef6af-2205-6034-8735-45ef6af965a7","d":"2006-05-08 07:43:43","u":"anon","n":"Florian Hengartner","c":"<b>Openid<\/b><br\/>\n<p>Openid describes itself as &quot;decentralized identity system&quot;, i think it may be what you are looking for http:\/\/openid.net\/.   <\/p>\n<p>Globally recognized avator - mainly for blogs is interesting too. http:\/\/www.gravatar.com\/  <\/p>","email":"Florian Hengartner","url":null},{"i":"445f46c4-1a19-1174-8064-45f46c485ddf","d":"2006-05-08 13:25:24","u":"anon","n":"Eric Coleman","c":"<b>What about IP.Converge<\/b><br\/>\n<p>http:\/\/forums.invisionpower.com\/index.php?showtopic=209274   <\/p>\n<p>Looks like they've been working on bringing this to the many products they offer.  There used to be a lot more information published on it, but I can't seem to find any, and honestly, it's 9am and I'm feelin lazy.  <\/p>","email":"Eric Coleman","url":null},{"i":"44611c65-5da3-2855-6270-4611c6558859","d":"2006-05-09 22:49:09","u":"anon","n":"Kevin Turner","c":"<b>Second for OpenID<\/b><br\/>\n<p>I second Florian's recommendation for OpenID.  LiveJournal and TypeKey both provide OpenID authentication services for their users.  While those aren't &quot;big guys&quot; in the same way as Yahoo and Google are, it's still upteen million users or so.  There are some other providers out there like My OpenID (http:\/\/www.myopenid.com\/) as well.   <\/p>\n<p>See OpenID Enabled (http:\/\/www.openidenabled.com\/) for both client and server implementations in just about every language you've ever written a webapp in, as well as plug-ins for mediawiki, moinmoin, drupal, etc, etc.   <\/p>\n<p>(Disclaimer: I work for the company that runs My OpenID (http:\/\/www.myopenid.com\/) and OpenID Enabled (http:\/\/www.openidenabled.com\/).)   <\/p>\n<p>MS Passport is dead, by the way.  But MS has a new thing coming called InfoCard.  See Kim Cameron's Identity Blog (http:\/\/www.identityblog.com\/).   <\/p>","email":"Kevin Turner","url":null},{"i":"44641ebc-0da7-2848-4869-4641ebcb5006","d":"2006-05-12 05:35:56","u":"anon","n":"weston","c":"<b>Sxip homesites you can use<\/b><br\/>\n<p>There are two sxip homesites you can use that I know, http:\/\/homesite.sxore.com and http:\/\/test.sxip.org\/homesite. The first is a production homesite whereas the second is for testing purposes.   <\/p>\n<p>(Disclosure: I work at Sxip Identity.)   <\/p>","email":"weston","url":null}]