[{"i":"4338e34a-9fc0-8173-4827-338e34a7d67d","d":"2005-09-27 06:14:34","u":"anon","n":"kevin@sitepoint.com","c":"<b>Highly recommend RenderX XEP<\/b><br\/>\n<p>At SitePoint (http:\/\/www.sitepoint.com\/), we've used RenderX XEP for several years to publish all of our books. As the one responsible for keeping our book rendering system healthy, I can certainly testify to the quality and reliability of the product.   <\/p>\n<p>We're in the process of implementing PDF rendering of all the articles on sitepoint.com using the product, but as the render is a relatively heavy process we will be pre-rendering on content submission, rather than upon request.  <\/p>","email":"kevin@sitepoint.com","url":null,"did":"51534408"},{"i":"43399aad-4729-8852-3359-3399aad07779","d":"2005-09-27 19:17:00","u":"anon","n":"Nuno Lopes","c":"<p>Also Apache FOP cosumes too much memory. It takes more than 1 GB to prcess the PHP manual. I'd also be glad to know if there is a better (and free) FO processor.  <\/p>","email":"Nuno Lopes","url":null,"did":"51534409"},{"i":"4339a2a2-a3db-8986-8399-339a2a28d43c","d":"2005-09-27 19:50:58","u":"anon","n":"Louis-Philippe Huberdeau","c":"<b>I played with FOP and RenderX<\/b><br\/>\n<p>I wrote a complete FO script to convert a technical manual from a custom XML format to PDF using Apache FOP. I tryed running the script under RenderX to see if it could run any faster, and the results were not those expected at all. I have the feeling the implementation of the XSL-FO specification is still immature... a bit like HTML a few years ago.   <\/p>\n<p>The script is now used in production using Apache FOP. It generated a manual of over 600 pages, including multiple SVG graphics. It does work well, but works better under the graphic designer's monster PC. Rasterizing the SVG images eats up a lot of memory and CPU. removing the images, generation time dropped from 15 minutes to a few seconds.   <\/p>\n<p>The solution is definetly not for web-real-time transactions, but if you can afford generating the documents over night, it's good enough.   <\/p>\n<p>Good part about FOP over RenderX is that there is no GUI.   <\/p>\n<p>I also generated a few documents using PDFLib with PHP (take care, there are changes between PHP4 and PHP5... and documentation was a problem a few months ago). It's not too hard, but for complex documents it might get harder. I can't really compare on large scales.  <\/p>","email":"Louis-Philippe Huberdeau","url":null,"did":"51534410"},{"i":"44fd868e-214d-8286-5688-4fd868e95de6","d":"2006-09-05 14:15:42","u":"anon","n":"Josh Goodyer","c":"<b>Ecrion XF Rendering Server<\/b><br\/>\n<p>We are using Ecrion XF Rendering Server from www.ecrion.com (http:\/\/www.ecrion.com) to process invoices from XML to PDF (via XSL-FO). It is very fast and it costs only $995. Very reliable and consumes a lot less memory.  <\/p>","email":"Josh Goodyer","url":null,"did":"51534411"}]