[{"i":"433150b3-def0-1958-7686-33150b330738","d":"2005-09-21 12:23:15","u":"anon","n":"Hatem","c":"<p>I totaly agree, it's not transparent even that most of them are using moderation to protect against spam... But there is better way for spam  <\/p>","email":"Hatem","url":null},{"i":"4331530d-3582-3529-0881-331530d7713f","d":"2005-09-21 12:33:17","u":"http:\/\/derickrethans.nl\/","n":"Derick Rethans","c":"<b>I Moderate<\/b><br\/>\n<p>I moderate to fight comment spam only - as there is no better way. I don't mind critisism as long as it's not insulting.  <\/p>","email":"http:\/\/derickrethans.nl\/","url":"http:\/\/derickrethans.nl\/"},{"i":"43315bc9-24db-8643-4505-3315bc974f9f","d":"2005-09-21 13:10:33","u":"anon","n":"jsweat_php@yahoo.com","c":"<b>time zones<\/b><br\/>\n<p>I can't comment on the particular instance you are talking about, but I have seen some blogging software which seems to post comment times off of the users localtime rathre than the servers.  This makes some comments &quot;spring up&quot; in the list to appear as if they were entered prior to comments which were actually entered before cronologically.  <\/p>","email":"jsweat_php@yahoo.com","url":null},{"i":"43317143-f324-3058-5315-331714351b0f","d":"2005-09-21 14:42:11","u":"anon","n":"Greg Beaver","c":"<b>STOP NOW<\/b><br\/>\n<p>Wez, remove this entry right now, I DID TRY TO APPROVE YOUR COMMENT and it did not work, and I did not notice.  Nothing more.  I have approved EVERY non-spam comment and I continue to approve EVERY non-spam comment.   <\/p>\n<p>I don't care if they are insulting.   <\/p>\n<p>At least I don't post childish blog entries and defame good code with blog entries rather than try to cooperate with the developers who are doing nothing more than try to solve issues that are faced in installing other people's packages.   <\/p>\n<p>You should be ashamed.  You've made your crusade against working <b>with<\/b> me on solving your problems with PEAR suddenly an unreasonable personal attack on my character.  Can you explain to me why this is a good thing in any way shape or form?  <\/p>","email":"Greg Beaver","url":null},{"i":"43317214-bf02-1648-5936-33172144ff52","d":"2005-09-21 14:45:40","u":"anon","n":"Greg Beaver","c":"<b>not to mention it was only 1 comment<\/b><br\/>\n<p>Let the record show that only one comment was overlooked.  This entry continues to defame by suggesting that it was <b>multiple<\/b> comments.   <\/p>\n<p>despicable.  <\/p>","email":"Greg Beaver","url":null},{"i":"433173f9-3c36-6403-7415-33173f9b824a","d":"2005-09-21 14:53:45","u":"http:\/\/www.coffeecode.net\/","n":"Dan Scott","c":"<b>Blog moderation vs. accessibility<\/b><br\/>\n<p>I moderate my blog comments because s9y originally required CAPTCHA as a plug-in, and because I don't believe in using CAPTCHA to block spam (because the tradeoff is that the visually impaired get screwed over by CAPTCHA).   <\/p>\n<p>However, it seems that one of the recent point releases of s9y added CAPTCHA by default, so now, having been too lazy to disable CAPTCHA, I have a blog with both CAPTCHA and moderated comments. There's certainly no spam going through, at least...   <\/p>\n<p>Note that there's nothing to prevent an evil blog owner from deleting comments after they have been posted anyways; call it post-facto moderation rather than pre-emptive moderation.  <\/p>","email":"http:\/\/www.coffeecode.net\/","url":"http:\/\/www.coffeecode.net\/"},{"i":"43317e45-1b5b-6782-8342-3317e4535c2f","d":"2005-09-21 15:37:41","u":"anon","n":"aaron@wormus.com","c":"<b>Moderation<\/b><br\/>\n<p>I have had my blog for just over 2 years, and I get at least 100 spams a day (on a slow day).   <\/p>\n<p>I don't believe in CAPTCHA's, but a black list which I've built over the last 2 years, and not allowing more than 4 links on a page catches 95% of the SPAM.   <\/p>\n<p>Why I'm saying this I don't know... but my elaborate system has eaten legit comments, and I can imagine having to moderate individual comments would be even more problematic.   <\/p>\n<p>If anyone wants a copy of my ever-evolving black list drop me an email.  <\/p>","email":"aaron@wormus.com","url":null},{"i":"43318032-7bd3-5513-7438-33180327cc59","d":"2005-09-21 15:45:54","u":"http:\/\/netevil.org\/","n":"wezfurlong","c":"<b>I think one of us is over-reacting<\/b><br\/>\n<p>From where I'm sitting, I have no way of knowing whether this was an accident in your blogging software or not.   <\/p>\n<p>It's clear that you're over-reacting to this whole thing; I've not once made any defamatory remarks about you or your code (I find it ironic that the missing comment even included a compliment on your work).   <\/p>\n<p>I suggest that you cool off before continuing with this mess.   <\/p>\n<p>PS: I used the plural &quot;comments&quot; because I made multiple comments in a single &quot;comment post&quot;.  It's an english language quirk.  <\/p>","email":"wez@netevil.org","url":"http:\/\/netevil.org"},{"i":"4331acdf-cfeb-2496-2494-331acdf200a0","d":"2005-09-21 18:56:31","u":"anon","n":"Greg Beaver","c":"<b>This blog post is in itself an over-reaction<\/b><br\/>\n<p>I quote:   <\/p>\n<p>&quot;I'm very dissappointed to see that my (perfectly reasonably) comments have not been &quot;accepted&quot; on a certain blog where a technical discussion has been taking place.&quot;   <\/p>\n<p>This is a direct reference to my blog, and not a general comment referring to all blogs.  You paint yourself as some kind of saint of reason whereas I am someone who censors your comments.  I simply expect better from someone of your stature in the PHP community.  Just because you don't agree with the technical solution that I have been outlining in my responses to your complaints does not give you the right to act this way.  (yes - I have described several solutions, including the built in &quot;pear convert&quot; which you keep ignoring, insisting that if I don't do this exactly the way you want that I have said nothing.)   <\/p>\n<p>All I ask is that you please keep the discussion above the belt, and that you email me first before publicly posting a defamatory post like this one.   <\/p>\n<p>Yes, accusing someone of censoring opposition is defamatory, especially when it is groundless.  I am not splitting hairs, Wez.  You also say you will &quot;not trust moderated blogs to be fair or honest again&quot; implying that I was neither fair nor honest.  This is pretty clear cut - you are referred in a sideways fashion to my blog and indirectly as a result to my actions as maintainer of that blog.   <\/p>\n<p>All I ask is that you publicly apologize for this very public smear.  The people reading your blog are not stupid - they know exactly who and what you are referring to with this post.  <\/p>","email":"Greg Beaver","url":null},{"i":"4331b1a1-1953-1241-5342-331b1a1a5647","d":"2005-09-21 19:16:49","u":"anon","n":"Ivo Jansch","c":"<b>Is this 'as the world turns' or a php blog? <\/b><br\/>\n<p>Hmm,   <\/p>\n<p>seems like a good soap on this entry.   <\/p>\n<p>Greg, I read most of the blogs of people that are listed on planet-php or phpdeveloper.org, but I had no idea that Wez was talking about your blog. I think he did a nice anonymous post about commenting in general. (to be honest, I thought 'hmm, is he talking about blog.phpdeveloper.org?' because I'd posted some comments there last night which didn't get through at first but Enygma actually just was away for the night)   <\/p>\n<p>(in other words, had you not posted your comment here but just privately notified Wez about your moderation error, probably all would have been just fine now)  <\/p>","email":"Ivo Jansch","url":null},{"i":"43340022-7b78-9336-0156-33400229a6c6","d":"2005-09-23 13:16:18","u":"anon","n":"Eric Coleman","c":"<b>If you have been following<\/b><br\/>\n<p>If you have been following the Pear 1.4 release, and wez &amp; gregs blog, you'd have a damn good idea what this blog post was referring to..... I knew it had to be greg before anything was even said.   <\/p>\n<p>I think you both should just kiss and make up :P  Shit happens, and im sure you'll find a solution to your problems.  <\/p>","email":"Eric Coleman","url":null},{"i":"433518b8-8a27-8302-0773-33518b89b6f2","d":"2005-09-24 09:13:28","u":"anon","n":"anon","c":"<b>i guessed it was greg's blog...<\/b><br\/>\n<p>...because i've also had comments fail to appear.  <\/p>","email":"anon","url":null}]